{
  "Core Platform & Utilities": {
    "description": "A foundational layer of shared components, including logging, memory management, and low-level system interactions, that provides the essential building blocks for all Datadog monitoring products.",
    "functions": {
      "Core Primitives & Utilities": {
        "files": [
          {
            "path": "libdd-tinybytes/CHANGELOG.md",
            "description": "This file is a changelog that documents the release history, new features, and changes for the libdd-tinybytes library, including version numbers, dates, and descriptions of modifications.",
            "spof": true
          },
          {
            "path": "libdd-tinybytes/README.md",
            "description": "This README describes `libdd-tinybytes`, a lightweight Rust library providing immutable, reference-counted byte buffers. It highlights its zero-copy operations, `AsRef<[u8]>` support, and types like `Bytes` and `BytesString`.",
            "spof": true
          },
          {
            "path": "libdd-tinybytes/src/test.rs",
            "description": "This file contains unit and property tests for the `Bytes` type, covering functionalities like slicing, cloning, memory management, and serialization to ensure its correctness and expected behavior.",
            "spof": false
          },
          {
            "path": "libdd-tinybytes/src/lib.rs",
            "description": "This file defines an immutable, reference-counted `Bytes` type for efficient zero-copy storage, cloning, and slicing of byte sequences in Rust.",
            "spof": true
          },
          {
            "path": "libdd-tinybytes/src/bytes_string.rs",
            "description": "This file defines the `BytesString` struct, a wrapper around `tinybytes::Bytes` that guarantees its contents are valid UTF-8. It provides methods for creating string-backed byte buffers and interacting with them as `&str`.",
            "spof": false
          },
          {
            "path": "libdd-common/README.md",
            "description": "This README describes `libdd-common`, a Rust library providing common utilities and foundational components shared across Datadog telemetry libraries, such as HTTP client support, entity ID detection, and tag management.",
            "spof": true
          },
          {
            "path": "libdd-common/CHANGELOG.md",
            "description": "This file serves as a changelog, documenting all notable changes made to the libdd-common component of the libdatadog repository, organized by version and date. It includes new features, changes, and bug fixes.",
            "spof": true
          },
          {
            "path": "libdd-common/src/cstr.rs",
            "description": "This file provides macros and validation functions for safely creating null-terminated C string (`CStr`) instances from Rust string or byte literals, ensuring proper C string conventions like null-termination and absence of embedded nulls.",
            "spof": false
          },
          {
            "path": "libdd-common/src/test_utils.rs",
            "description": "Provides common testing utilities for `libdatadog` crates, including temporary file management with RAII guards and robust parsing of HTTP requests, including multipart form data.",
            "spof": false
          },
          {
            "path": "libdd-common/src/rate_limiter.rs",
            "description": "This file implements a thread-safe, sliding-window rate limiter using atomic operations. It controls the frequency of events by tracking a hit count against a time-based limit, with platform-specific time granularity.",
            "spof": false
          },
          {
            "path": "libdd-common/src/tag.rs",
            "description": "This file defines the `Tag` struct, which represents a key-value pair for tagging data in Datadog. It provides methods for creating `Tag` instances at compile-time (via macro) and runtime, as well as functionality for parsing tag strings from various sources.",
            "spof": false
          },
          {
            "path": "libdd-common/src/unix_utils/file_ops.rs",
            "description": "This file provides a utility function to open a file for appending, creating it if necessary, or to open `/dev/null` if no filename is specified, returning a raw file descriptor.",
            "spof": false
          },
          {
            "path": "libdd-alloc/CHANGELOG.md",
            "description": "This file documents all notable changes and version releases for the libdd-alloc component within the libdatadog library.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/timespec.rs",
            "description": "This file defines a `Timespec` struct, representing time as seconds and nanoseconds since the Unix Epoch, and provides conversions between it, `chrono::DateTime<Utc>`, and `std::time::SystemTime`.",
            "spof": false
          },
          {
            "path": "libdd-common-ffi/src/tags.rs",
            "description": "This file provides Foreign Function Interface (FFI) bindings for creating, managing, and parsing Datadog tags. It enables external languages to interact with Rust's tag parsing and manipulation logic.",
            "spof": false
          },
          {
            "path": "ruby/lib/libdatadog/version.rb",
            "description": "This file defines the version numbers for the `libdatadog` Ruby gem, including the underlying library version and the gem's specific major/minor versions. It consolidates these into a full `VERSION` string.",
            "spof": false
          },
          {
            "path": "tools/cc_utils/src",
            "description": "This directory is intended to house the C/C++ source code for utility functions and tools. These utilities likely support the development, testing, or operation of `libdatadog` components.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Julio Gonzalez",
            "percent": 33
          },
          {
            "name": "Bob Weinand",
            "percent": 32
          },
          {
            "name": "Igor Unanua",
            "percent": 25
          }
        ]
      },
      "Data Serialization & Deserialization": {
        "files": [
          {
            "path": "libdd-trace-protobuf/src/_includes.rs",
            "description": "This file aggregates and re-exports auto-generated Protobuf Rust modules, including `pb.rs`, `pb.idx.rs`, and `remoteconfig.rs`, for use within the `libdd-trace-protobuf` library. It acts as a central inclusion point for these Protobuf-defined structures.",
            "spof": false
          },
          {
            "path": "libdd-trace-protobuf/src/lib.rs",
            "description": "This file serves as the main library entry point for the `libdd-trace-protobuf` crate, handling protobuf-related data structures and deserialization logic for Datadog tracing.",
            "spof": false
          },
          {
            "path": "libdd-trace-protobuf/src/serde.rs",
            "description": "Provides custom serialization and deserialization traits and helper functions for the `serde` crate, specifically handling byte vector types like `Vec<Vec<u8>>` and `Vec<serde_bytes::ByteBuf>`.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/varint.rs",
            "description": "This file provides utility functions for encoding unsigned and signed 64-bit integers as Protocol Buffers varints and determining their encoded length.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/util/serde.rs",
            "description": "This file provides utility functions for serializing and deserializing `std::io::ErrorKind` to and from `u32` integers using the Serde framework.",
            "spof": false
          },
          {
            "path": "libdd-telemetry/src/data/payload.rs",
            "description": "This file defines the `Payload` enum, which represents the various types of telemetry data requests that can be sent or received within the Datadog telemetry system. It includes serialization logic for these different payload types.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/error.rs",
            "description": "This file defines the `DecodeError` enum, which enumerates various errors that can occur during MsgPack decoding. It also implements the `Display` trait for these errors, providing user-friendly messages.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/map.rs",
            "description": "This file provides utility functions for decoding MessagePack (MsgPack) map structures from a buffer into Rust `HashMap`s, including reading the map's length and its key-value pairs.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/number.rs",
            "description": "This file defines the `Number` enum and provides functionality for decoding MessagePack-encoded numbers into various Rust numeric types, handling signed, unsigned, and floating-point values, and managing nullable number conversions.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/string.rs",
            "description": "This file provides utility functions for decoding MessagePack strings and string-to-string maps, including handling for null values, within the `libdatadog` project's MessagePack decoder.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "vianney",
            "percent": 78
          },
          {
            "name": "Bob Weinand",
            "percent": 20
          },
          {
            "name": "shreyamalpani",
            "percent": 1
          }
        ]
      },
      "Process & Worker Management": {
        "files": [
          {
            "path": "libdd-common/src/worker.rs",
            "description": "Defines the `Worker` trait, which represents a generic worker responsible for running asynchronous, periodic tasks in a loop.",
            "spof": false
          },
          {
            "path": "libdd-common/src/unix_utils/execve.rs",
            "description": "This file provides a Rust abstraction (`PreparedExecve`) for preparing arguments and environment variables for the `execve` system call, ensuring proper conversion from Rust strings to C-style strings and safe execution.",
            "spof": false
          },
          {
            "path": "libdd-common/src/unix_utils/process.rs",
            "description": "This file provides Unix-specific utilities for process management, including non-blocking child process reaping, immediate program termination, and polling file descriptors for hang-up events.",
            "spof": false
          },
          {
            "path": "libdd-common/src/unix_utils/fork.rs",
            "description": "Provides an alternative `fork`-like function (`alt_fork`) with OS-specific implementations, specifically designed for Linux to use `clone` syscall and handle process tracing without invoking `atfork` handlers, and for macOS to use `libc::fork`.",
            "spof": false
          },
          {
            "path": "libdd-common/src/unix_utils/mod.rs",
            "description": "This module provides a collection of Unix-specific utilities, including functionalities for process execution, file operations, forking, and process management.",
            "spof": false
          },
          {
            "path": "libdd-common/tests/execve_integration.rs",
            "description": "This file contains integration tests for the `PreparedExecve::exec` function, verifying its ability to execute external commands with various arguments and environment variables, and handling failure scenarios like non-existent binaries.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/src/pausable_worker.rs",
            "description": "This file defines a `PausableWorker` that allows background tasks to be paused and resumed, preserving their state. This is primarily used to safely stop all threads before a process fork to prevent deadlocks in the child process.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/tokio_util.rs",
            "description": "This file provides Tokio-specific utilities, including a macro for spawning tasks with error handling and a function for conditionally running or spawning shared futures.",
            "spof": true
          },
          {
            "path": "spawn_worker/tests/trampoline_windows.rs",
            "description": "This file contains Windows-specific integration tests for the `spawn_worker` crate, verifying its ability to spawn a process using a manual trampoline target and capture its output.",
            "spof": false
          },
          {
            "path": "spawn_worker/tests/trampoline_unix.rs",
            "description": "This file contains a unit test for the `spawn_worker` crate, specifically verifying the functionality of spawning a worker process using a manual trampoline mechanism on Unix systems.",
            "spof": false
          },
          {
            "path": "spawn_worker/src/lib.rs",
            "description": "This file defines core structures and utilities for spawning worker processes or injecting code using a 'trampoline' mechanism, handling platform-specific binaries and data passing for dynamic execution.",
            "spof": true
          },
          {
            "path": "spawn_worker/src/win32.rs",
            "description": "This file provides the Windows-specific implementation for spawning new worker processes. It manages process creation, I/O redirection, environment variables, and the injection of shared library dependencies or custom entry points using Windows API calls.",
            "spof": true
          },
          {
            "path": "spawn_worker/src/unix/fork.rs",
            "description": "This file provides a safe wrapper around the `fork(2)` system call for Unix-like systems, enabling the creation of new processes. It includes utilities for executing code in child processes and handling panics within them, primarily used for testing.",
            "spof": true
          },
          {
            "path": "spawn_worker/src/unix/mod.rs",
            "description": "This file provides UNIX-specific utilities for process management, including functions for spawning child processes, inter-process communication via file descriptor passing, and retrieving dynamically loaded library information.",
            "spof": false
          },
          {
            "path": "tests/spawn_from_lib/src/lib.rs",
            "description": "This file defines a Rust library that provides an entry point for a spawned worker process, designed to test its ability to write to standard output, standard error, and a passed file descriptor.",
            "spof": true
          },
          {
            "path": "tests/spawn_from_lib/tests/spawn_unix.rs",
            "description": "This file contains a test for spawning a child process from a library on Unix systems, verifying the redirection of standard I/O and the passing of file descriptors (FdExec/Exec trampolining).",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 71
          },
          {
            "name": "Kevin Gosse",
            "percent": 10
          },
          {
            "name": "Pawel Chojnacki",
            "percent": 9
          }
        ]
      },
      "FFI Building Blocks & Tooling": {
        "files": [
          {
            "path": "libdd-common/src/error.rs",
            "description": "This file defines the `FfiSafeErrorMessage` trait, ensuring that static error messages are compatible with both Rust and C FFI requirements, including UTF-8 validity and null-termination.",
            "spof": false
          },
          {
            "path": "examples/ffi/README.md",
            "description": "This README provides documentation and instructions for building, running, and adding FFI (Foreign Function Interface) examples for `libdatadog`. It details both automated testing and manual build/run procedures.",
            "spof": true
          },
          {
            "path": "examples/ffi/array_queue.cpp",
            "description": "This file provides an example demonstrating the use of the `ddog_ArrayQueue` (likely a C-FFI concurrent array queue) in a multi-threaded C++ application, showcasing producer-consumer interaction and error handling.",
            "spof": true
          },
          {
            "path": "docs/RFCs/0001-delivering-different-features.md",
            "description": "This RFC discusses various strategies for building and delivering features within libdatadog, aiming to address the need for modularity and selective inclusion of features. It analyzes multiple approaches and proposes a recommended solution for different language environments.",
            "spof": false
          },
          {
            "path": "libdd-common-ffi/README.md",
            "description": "This README provides an overview and documentation for `libdd-common-ffi`, which offers C FFI bindings for shared utilities from `libdd-common`. It details features like tag management, endpoint configuration, and error handling for C and other languages.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/cstr.rs",
            "description": "This file provides FFI-safe (Foreign Function Interface) equivalents for Rust's `std::ffi::CStr` and `std::ffi::CString` types, enabling safer and easier interoperability with C-style null-terminated strings across the FFI boundary.",
            "spof": false
          },
          {
            "path": "libdd-common-ffi/src/handle.rs",
            "description": "Defines a C-compatible opaque `Handle` struct for managing Rust objects across FFI boundaries, ensuring safe allocation, access, and deallocation of the inner value via raw pointers.",
            "spof": false
          },
          {
            "path": "libdd-common-ffi/src/option.rs",
            "description": "This file defines a C-compatible `Option` enum (`Option<T>`) for use across FFI boundaries. It provides conversion functions to and from Rust's standard library `Option` type, along with utility methods and `no_mangle` functions for direct C interop.",
            "spof": false
          },
          {
            "path": "libdd-common-ffi/src/lib.rs",
            "description": "This file is the main library entry point for `libdd-common-ffi`, providing common utilities and data structures for Foreign Function Interface (FFI) interactions.",
            "spof": false
          },
          {
            "path": "libdd-common-ffi/src/utils.rs",
            "description": "This file provides macros and utilities for wrapping Rust functions for C-FFI (Foreign Function Interface) calls, primarily focusing on converting Rust panics and errors into a format consumable by C.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/vec.rs",
            "description": "This file defines a custom `Vec` struct that represents the raw parts of a standard Rust `Vec`, enabling safe conversions between them, primarily for use in Foreign Function Interface (FFI) contexts.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/error.rs",
            "description": "This file defines an FFI-compatible error type for `libdatadog`, enabling C/C++ consumers to receive and manage Rust errors. It provides conversions from common Rust error types and C-callable functions for dropping errors and retrieving their messages.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/string.rs",
            "description": "This file defines `StringWrapper`, a struct designed for safely passing owned string data across Foreign Function Interface (FFI) boundaries. It includes utilities for conversion between Rust `String` and `StringWrapper`, along with FFI-exposed functions for managing and accessing the string, and a result type for FFI error handling.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/result.rs",
            "description": "This file defines FFI-compatible `Result` and `VoidResult` enum types for safely returning operation outcomes (with or without a value) and custom `Error` types across language boundaries, particularly for C interop.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/slice.rs",
            "description": "This file defines an FFI-safe `Slice` struct, providing a C-compatible representation of Rust slices (`&[T]`). It includes utilities for safe conversion between FFI slices and Rust slices, error handling for common FFI issues, and specialized aliases like `CharSlice` and `ByteSlice` for interoperability.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/slice_mut.rs",
            "description": "This file defines `MutSlice`, a C-compatible mutable slice structure designed for safe interaction with FFI (Foreign Function Interface). It provides methods for creating, converting, and validating mutable slices, explicitly handling potential FFI errors.",
            "spof": true
          },
          {
            "path": "libdd-common-ffi/src/array_queue.rs",
            "description": "This file implements an FFI-compatible wrapper around `crossbeam_queue::ArrayQueue` to provide a C-callable, lock-free, bounded multi-producer multi-consumer queue for raw pointers.",
            "spof": false
          },
          {
            "path": "ruby/README.md",
            "description": "This README provides documentation for the `libdatadog` Ruby gem, explaining its purpose, how to develop and test it, and the process for releasing new versions to RubyGems.",
            "spof": false
          },
          {
            "path": "ruby/spec/gem_packaging.rb",
            "description": "This file contains RSpec tests that validate the integrity and correctness of a Ruby gem after it has been packaged, specifically checking file permissions within the gem and symbol prefixes in its shared libraries.",
            "spof": false
          },
          {
            "path": "ruby/spec/libdatadog_spec.rb",
            "description": "This RSpec test file verifies the `Libdatadog` module's ability to correctly identify and locate its bundled native binaries and related configuration files (like pkgconfig, crashtracking receiver, and libraries) across various platform and environment scenarios.",
            "spof": false
          },
          {
            "path": "ruby/lib/libdatadog.rb",
            "description": "This file provides Ruby helper methods within the `Libdatadog` module to locate and resolve paths for native `libdatadog` binaries and configuration files (`pkgconfig`) across various operating system platforms, including platform-specific normalization logic.",
            "spof": false
          },
          {
            "path": "libdd-library-config-ffi/README.md",
            "description": "This README file documents the C-compatible Foreign Function Interface (FFI) bindings for `libdd-library-config`. It explains how these bindings expose the library's functionality to C and other non-Rust languages.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Ivo Anjo",
            "percent": 50
          },
          {
            "name": "Jules Wiriath",
            "percent": 19
          },
          {
            "name": "Igor Unanua",
            "percent": 10
          }
        ]
      },
      "Inter-Process Communication (IPC) Framework": {
        "files": [
          {
            "path": "libdd-common/src/dump_server.rs",
            "description": "This module provides a local server (Unix domain socket or named pipe) to capture raw HTTP requests and write them to a file for testing and debugging purposes.",
            "spof": false
          },
          {
            "path": "datadog-ipc/README.md",
            "description": "This file is the README for the `datadog-ipc` component within `libdatadog`, likely providing an overview or documentation for the Inter-Process Communication (IPC) functionalities.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/sequential.rs",
            "description": "This file provides a sequential executor for tarpc server requests, processing them one by one through a single worker task instead of spawning a new task for each message. It queues incoming requests and drops them if the queue is full.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/handles.rs",
            "description": "This file defines traits for transporting platform-specific handles between processes and implements these traits for common Rust types and `tarpc` communication structures, facilitating safe inter-process communication of resources.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/rate_limiter.rs",
            "description": "This file provides an implementation for rate limiters using shared memory (SHM), enabling multiple processes to share and manage common rate limiting states. It includes mechanisms for allocating, accessing, and deallocating rate limiter data within shared memory segments.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/example_interface.rs",
            "description": "Defines and implements an example RPC service (`ExampleInterface`) and its server (`ExampleServer`) using `tarpc` within the `datadog-ipc` crate, demonstrating inter-process communication capabilities including file handle transfer.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/platform_handle.rs",
            "description": "This file defines a cross-platform `PlatformHandle` struct that wraps file descriptors/handles, enabling their safe sharing, cloning, serialization, and transfer across processes and threads, especially for inter-process communication (IPC).",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/mod.rs",
            "description": "This file serves as the root module for platform-specific (Unix/Windows) and platform-agnostic IPC components within `libdatadog`, integrating and re-exporting functionalities for memory handling, platform handles, channels, and messages.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/mem_handle.rs",
            "description": "This file defines structures and traits for managing shared memory regions, including anonymous and named shared memory, providing abstractions for mapping, accessing, resizing, and transferring memory handles.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/message.rs",
            "description": "This file implements methods for the `Message` struct, allowing it to provide a reference to its inner item and to transparently support handle transfer if the contained item also implements `TransferHandles`.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/unix/locks.rs",
            "description": "This file provides a Rust implementation of an exclusive file lock (`FLock`) for inter-process synchronization on Unix systems, utilizing `fcntl` to acquire write locks on a file path.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/unix/mem_handle_macos.rs",
            "description": "This file implements shared memory handling and memory mapping functionalities specifically for macOS, leveraging Unix system calls for inter-process communication within the Datadog IPC library.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/unix/message.rs",
            "description": "Defines the `Message` structure for inter-process communication (IPC) on Unix platforms, including a limit for file descriptor transfers. It serializes and deserializes the message payload along with the process ID.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/unix/channel.rs",
            "description": "Implements a `Channel` struct for inter-process communication over Unix domain sockets, supporting both data and file descriptor transfer.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/unix/sockets.rs",
            "description": "This file implements platform-specific (Unix, specifically Linux) socket operations, including checking if a Unix domain socket path is listening and handling abstract Unix domain sockets for inter-process communication.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/unix/mem_handle.rs",
            "description": "This file provides Unix-specific implementations for managing shared memory (SHM) regions, including creation, mapping, resizing, and unlinking. It includes fallbacks for `shm_open` on certain environments like AWS Lambda.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/unix/platform_handle.rs",
            "description": "This file provides the Unix-specific implementation for `PlatformHandle`, enabling conversion to/from raw file descriptors and managing their ownership. It also includes functionality to view these handles as socket-like objects.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/unix/channel/metadata.rs",
            "description": "This file defines the `ChannelMetadata` structure, which manages the transfer of file descriptors (handles) and process IDs over Unix-specific inter-process communication (IPC) channels. It provides methods for enqueuing, sending, receiving, and managing these handles within messages.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/unix/mod.rs",
            "description": "This module provides the Unix-specific implementation for Datadog's inter-process communication (IPC) library. It handles the management and transfer of platform-specific resources like file descriptors, including shared memory, and defines the core IPC channel and message structures for Unix systems.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/channel/mod.rs",
            "description": "This file serves as the module root for platform-specific IPC channel implementations within the `datadog-ipc` crate. It likely orchestrates channel mechanisms, including metadata handling, for a specific operating system or environment.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/channel/metadata.rs",
            "description": "This file implements the `HandlesTransport` trait for `ChannelMetadata`, enabling the transfer and retrieval of platform-specific OS handles (like file descriptors) over an inter-process communication channel.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/windows/named_pipe.rs",
            "description": "This file provides Windows-specific utilities for interacting with named pipes, primarily focused on extracting the name of a named pipe from its raw handle.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/windows/mod.rs",
            "description": "This file serves as the main module for Windows-specific inter-process communication (IPC) components within the `datadog-ipc` crate. It re-exports sub-modules defining IPC channels, messages, named pipes, and platform-specific handle management for Windows.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/windows/message.rs",
            "description": "Defines a generic `Message` structure for inter-process communication on Windows, designed to transfer data along with associated system handles between processes.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/windows/mem_handle.rs",
            "description": "This file provides Windows-specific implementations for creating, opening, mapping, and managing shared memory handles for inter-process communication within the `libdatadog` IPC library.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/windows/platform_handle.rs",
            "description": "This file defines a Windows-specific `PlatformHandle` struct for managing raw OS handles, providing safe ownership, conversion, and serialization functionalities. It wraps Windows `RawHandle`s, enabling their use across different contexts, potentially for inter-process communication.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/windows/channel.rs",
            "description": "This file implements a Windows-specific inter-process communication (IPC) channel, likely based on named pipes, providing `Read` and `Write` functionalities with support for asynchronous I/O and timeouts using Windows API calls.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/windows/channel/metadata.rs",
            "description": "This file provides Windows-specific utilities for managing and transferring OS handles between processes for inter-process communication, including mechanisms to duplicate handles to a target process and track them during message serialization/deserialization.",
            "spof": true
          },
          {
            "path": "datadog-ipc/src/platform/windows/channel/async_channel.rs",
            "description": "This file defines an asynchronous communication channel (`AsyncChannel`) for Windows, leveraging Named Pipes for inter-process communication. It wraps Tokio's `NamedPipeClient` and `NamedPipeServer` and implements `AsyncRead` and `AsyncWrite` traits, along with handling process metadata.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/transport/mod.rs",
            "description": "Defines an asynchronous, framed transport layer for inter-process communication (IPC) that serializes and deserializes messages using Bincode, supports length-delimited framing, and can transfer system handles.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tests/blocking_client.rs",
            "description": "This file contains a unit test for the `datadog_ipc` blocking client, demonstrating its ability to send requests and receive responses from an asynchronous server, including handling file descriptor passing.",
            "spof": true
          },
          {
            "path": "datadog-ipc/tarpc/src/lib.rs",
            "description": "This file is the `lib.rs` for the `tarpc` crate, an RPC framework for Rust. It defines the core functionalities, features, and usage patterns for building RPC services and clients.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/cancellations.rs",
            "description": "This file implements a mechanism for handling request cancellations using an unbounded MPSC channel, allowing cancellation signals to be sent and received for specific request IDs.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/server.rs",
            "description": "Provides the core server-side functionality for handling multiplexed RPC requests and managing client connections within the `tarpc` framework. It defines the `BaseChannel` struct for request lifecycle management, including cancellation and response handling.",
            "spof": true
          },
          {
            "path": "datadog-ipc/tarpc/src/transport.rs",
            "description": "This file defines the `Transport` trait, which abstracts over bidirectional message streams for RPC communication, allowing for protocol-agnostic and pluggable transport implementations.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/client.rs",
            "description": "This file implements the client-side logic for an RPC framework, providing mechanisms for sending multiplexed requests, managing their lifecycle, and handling cancellations.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/serde_transport.rs",
            "description": "This file implements a generic, Serde-based transport layer for asynchronous communication. It provides mechanisms to serialize and deserialize data over various I/O mediums, including TCP and Unix domain sockets.",
            "spof": true
          },
          {
            "path": "datadog-ipc/tarpc/src/server/in_flight_requests.rs",
            "description": "This file defines `InFlightRequests`, a data structure for tracking and managing asynchronous requests, aborting them either explicitly or when their deadlines expire.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/server/testing.rs",
            "description": "This file defines a `FakeChannel` implementation used for testing `tarpc` server components, providing an in-memory mock of a channel that can simulate incoming requests and outgoing responses.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/transport/channel.rs",
            "description": "This file provides in-memory, bi-directional channel implementations (`UnboundedChannel` and `Channel`) that act as `tarpc` transports for asynchronous message passing between services.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/examples/pubsub.rs",
            "description": "This file implements a publish-subscribe (pubsub) server using tarpc, defining the RPC services for publishers and subscribers and managing message distribution based on topics.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/examples/custom_transport.rs",
            "description": "This file is an example demonstrating the use of the `tarpc` RPC framework. It illustrates how to implement a custom transport layer using Unix sockets and bincode serialization for inter-process communication, though the example code is currently commented out.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/service_functional.rs",
            "description": "This file contains functional tests for the `tarpc` library, demonstrating its RPC service capabilities, various transport mechanisms (in-memory, TCP, UDS), and concurrent request handling.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail.rs",
            "description": "This file is intended to define compile-fail (UI) tests for the `tarpc` component, ensuring that certain code constructs produce expected compilation errors. Although currently commented out, it uses `trybuild` to test various error cases within the `datadog-ipc` library.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail/tarpc_service_fn_new.rs",
            "description": "This file tests that the `tarpc::service` macro correctly produces a compile-time error when an `async fn new()` method is defined without arguments, which is typically an invalid signature for a service method.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail/tarpc_service_arg_pat.rs",
            "description": "This file is a compile-fail test for the `tarpc` framework, specifically verifying that using a pattern (like a tuple destructuring) directly as an argument in a `tarpc::service` method fails to compile as expected.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail/tarpc_server_missing_async.rs",
            "description": "This file is a compile-fail test for `tarpc`, verifying that a server implementation missing the `async` keyword for a service method that was declared as `async` will correctly fail to compile.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail/must_use_request_dispatch.rs",
            "description": "This file is a compile-fail test for the `tarpc` library, specifically ensuring that ignoring the return value of a `dispatch` call correctly triggers a `#[deny(unused_must_use)]` error. It validates that the `dispatch` method is appropriately marked with `#[must_use]`.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail/tarpc_service_fn_serve.rs",
            "description": "This file is a compile-fail test for the `tarpc` crate, specifically checking that defining an `async fn serve()` method directly within a `#[tarpc::service]` trait correctly results in a compilation error.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail/tokio/must_use_channel_executor.rs",
            "description": "This is a compile-fail test for the `tarpc` framework, verifying that the `server.execute()` method correctly triggers a `#[deny(unused_must_use)]` lint if its returned future is not used.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail/tokio/must_use_server_executor.rs",
            "description": "This test file verifies that `tarpc`'s server `execute` method correctly triggers a `#[deny(unused_must_use)]` lint when its future return value is not used, ensuring server execution is explicitly handled.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 79
          },
          {
            "name": "Gustavo Lopes",
            "percent": 7
          },
          {
            "name": "Igor Unanua",
            "percent": 5
          }
        ]
      },
      "Network Transport & HTTP Client Abstraction": {
        "files": [
          {
            "path": "libdd-common/src/hyper_migration.rs",
            "description": "This module provides utility functions for creating and configuring `hyper` HTTP clients, defines a flexible custom `Body` enum for HTTP request/response bodies, and handles associated error types, likely facilitating a migration or integration with `hyper-util`.",
            "spof": true
          },
          {
            "path": "libdd-common/src/lib.rs",
            "description": "This file serves as the core library for `libdd-common`, providing shared utilities, HTTP client abstractions, common HTTP header definitions, and endpoint management for Datadog services, including specialized URI parsing.",
            "spof": true
          },
          {
            "path": "libdd-common/src/connector/errors.rs",
            "description": "This file defines an enumeration of common errors that can occur during connector operations, such as invalid URLs, timeouts, or issues with TLS connections and socket types. It implements standard error and display traits for these error types.",
            "spof": false
          },
          {
            "path": "libdd-common/src/connector/mod.rs",
            "description": "This module defines a `Connector` that abstracts over different transport mechanisms (HTTP, HTTPS, Unix Domain Sockets, Named Pipes) for establishing network connections within the application. It handles the initialization and configuration of HTTP and HTTPS clients, including TLS certificate loading and crypto provider setup.",
            "spof": true
          },
          {
            "path": "libdd-common/src/connector/uds.rs",
            "description": "This file provides utility functions for converting between Unix domain socket paths and `hyper::Uri` objects, encoding and decoding the socket path as a hex string within the URI's authority to handle special characters.",
            "spof": false
          },
          {
            "path": "libdd-common/src/connector/conn_stream.rs",
            "description": "This file defines a `ConnStream` enum that unifies various network connection types (TCP, TLS, Unix domain sockets, Windows named pipes) into a single interface for asynchronous I/O with the `hyper` HTTP client.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/compile_fail/serde_transport/must_use_tcp_connect.rs",
            "description": "This is a compile-fail test verifying that `serde_transport::tcp::connect` is correctly marked with `#[must_use]`. It ensures a compilation error occurs if the return value of the connect function is ignored.",
            "spof": false
          },
          {
            "path": "libdd-common-ffi/src/endpoint.rs",
            "description": "Provides C-compatible FFI functions for creating, configuring, and managing Datadog `Endpoint` objects from various sources like URLs, filenames, and API keys.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Daniel Schwartz-Narbonne",
            "percent": 83
          },
          {
            "name": "vianney",
            "percent": 9
          },
          {
            "name": "Jules Wiriath",
            "percent": 6
          }
        ]
      },
      "Execution Environment & Container Identification": {
        "files": [
          {
            "path": "libdd-common/src/azure_app_services.rs",
            "description": "This file detects and extracts metadata about the current execution environment when running in Azure App Services or Azure Functions, parsing relevant environment variables to provide structured Azure context information.",
            "spof": false
          },
          {
            "path": "libdd-common/src/entity_id/mod.rs",
            "description": "This file is responsible for extracting and providing identifiers related to the execution environment, such as container IDs, entity IDs, and external environment variables, primarily for use in request headers.",
            "spof": true
          },
          {
            "path": "libdd-common/src/entity_id/unix/container_id.rs",
            "description": "This module provides functions to parse and extract container IDs from cgroup files on Unix-like systems, using regular expressions to match various ID formats.",
            "spof": false
          },
          {
            "path": "libdd-common/src/entity_id/unix/mod.rs",
            "description": "This module provides functionality to determine a unique entity ID for a process on Unix-like systems, primarily by extracting container IDs or cgroup inode information from cgroup files. It supports different cgroup versions and offers cached access to these derived IDs.",
            "spof": false
          },
          {
            "path": "libdd-common/src/entity_id/unix/cgroup_inode.rs",
            "description": "This module provides functionality to determine a process's cgroup node path and retrieve its inode, specifically designed for Unix systems to identify the cgroup (container) a process belongs to, excluding host cgroup namespaces.",
            "spof": false
          },
          {
            "path": "libdd-common/tests/cgroup/memory/user.slice/user-0.slice",
            "description": "This directory contains test-related data or fixtures specifically designed to simulate the cgroup memory structure for a 'user-0.slice' on a Linux system. Its purpose is to provide a controlled environment for `libdd-common`'s unit or integration tests that interact with cgroup memory metrics. It ensures robust testing of cgroup memory parsing and monitoring functionalities.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/config_utils.rs",
            "description": "This file provides utility functions for detecting various cloud environments and constructing URLs for Datadog's trace and stats intake endpoints.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Daniel Schwartz-Narbonne",
            "percent": 100
          }
        ]
      },
      "Address Symbolization": {
        "files": [
          {
            "path": "examples/ffi/symbolizer.cpp",
            "description": "This file is an example demonstrating how to use the Blazesym library to symbolize absolute addresses within the current process. It showcases fetching the current instruction pointer and resolving it to a symbol name.",
            "spof": false
          },
          {
            "path": "symbolizer-ffi/README.md",
            "description": "This README describes the symbolizer-ffi project, which forwards the blazesym C APIs and notes that changes should be upstreamed to blazesym.",
            "spof": true
          },
          {
            "path": "symbolizer-ffi/src/lib.rs",
            "description": "This file serves as the main library entry point for the symbolizer FFI, conditionally including and re-exporting symbolization functionalities specifically for non-Windows platforms.",
            "spof": true
          },
          {
            "path": "symbolizer-ffi/src/blazesym.h",
            "description": "This C header file provides the Foreign Function Interface (FFI) for the blazesym library, defining data structures and error codes for symbolization and address normalization. It allows C programs to interact with blazesym's core functionalities.",
            "spof": false
          },
          {
            "path": "symbolizer-ffi/src/symbolize.rs",
            "description": "This file serves as an FFI layer for libdatadog's symbolizer, primarily re-exporting all public functions and types from the `blazesym_c` crate.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 33
          },
          {
            "name": "r1viollet",
            "percent": 32
          },
          {
            "name": "Julio Gonzalez",
            "percent": 31
          }
        ]
      },
      "Internal Telemetry & Diagnostics Logging": {
        "files": [
          {
            "path": "docs/RFCs/0010-logging-in-libdatadog.md",
            "description": "This document is an RFC outlining the design for adding internal logging capabilities to libdatadog. It proposes methods for configuring logging to standard output or files, primarily for Datadog's troubleshooting purposes.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/CHANGELOG.md",
            "description": "This file is the changelog for the `libdd-telemetry` library, detailing its version history, including new features, changes, and bug fixes for each release.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/README.md",
            "description": "This file is the README for `libdd-telemetry`, an internal library designed for collecting and reporting operational metrics, configuration, and errors from Datadog libraries.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/src/info.rs",
            "description": "This file provides functions to gather and retrieve various operating system and host-related information, such as hostname, OS name, version, type, and release.",
            "spof": false
          },
          {
            "path": "libdd-telemetry/src/lib.rs",
            "description": "This file is the main library entry point for the `libdd-telemetry` crate, responsible for gathering and providing host-specific telemetry information like hostname, OS details, and kernel versions.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/src/config.rs",
            "description": "This file defines the configuration structures and logic for the `libdd-telemetry` library, handling settings for telemetry data collection and submission, primarily through environment variables and agent connection details.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/src/data/common.rs",
            "description": "Defines common data structures for telemetry reporting, including API version, application details, host information, and the main telemetry payload structure.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/src/data/payloads.rs",
            "description": "This file defines data structures (structs and enums) that represent various telemetry payloads and events, such as application startup, dependencies, integrations, configurations, logs, metrics, distributions, and endpoints, used within the `libdatadog` project.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/src/data/mod.rs",
            "description": "This file serves as a module aggregator, re-exporting common data structures, telemetry payloads, and metrics definitions for the `libdd-telemetry` crate. It organizes and exposes various data-related components.",
            "spof": false
          },
          {
            "path": "libdd-log/README.md",
            "description": "This file is the README for `libdd-log`, a logging library developed by Datadog. It outlines the library's features, including structured logging, log levels, and integration with the Datadog logging backend.",
            "spof": true
          },
          {
            "path": "libdd-log/CHANGELOG.md",
            "description": "This file documents all notable changes and new features for the `libdd-log` component, with a focus on version release history.",
            "spof": true
          },
          {
            "path": "libdd-log/src/lib.rs",
            "description": "This file is the root library file for `libdd-log`, exposing modules for logging functionality and various log writers.",
            "spof": false
          },
          {
            "path": "libdd-log/src/logger.rs",
            "description": "This file implements a configurable global logger for the libdatadog library, enabling dynamic setup and modification of logging outputs (file, stdout/stderr) and log levels using the `tracing` ecosystem.",
            "spof": false
          },
          {
            "path": "libdd-log/src/writers.rs",
            "description": "This file provides various log writer implementations, including a custom file writer with size-based rotation and cleanup, an asynchronous non-blocking file writer, and a writer for standard output/error streams.",
            "spof": false
          },
          {
            "path": "libdd-telemetry-ffi/README.md",
            "description": "This README describes libdd-telemetry-ffi, which provides C-compatible FFI bindings for the internal libdd-telemetry library, enabling telemetry reporting from C, C++, and other language applications.",
            "spof": true
          },
          {
            "path": "libdd-log-ffi/README.md",
            "description": "This README describes `libdd-log-ffi`, which provides C-compatible FFI bindings for structured logging with features like a C API, log levels, and structured fields for the `libdd-log` library.",
            "spof": true
          },
          {
            "path": "libdd-log-ffi/src/lib.rs",
            "description": "This file provides the C Foreign Function Interface (FFI) bindings for configuring and controlling the Datadog logging library (`libdd_log`), allowing external C-compatible code to manage log output to standard streams or files and set log levels.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/log.rs",
            "description": "This file provides utilities for configuring and managing logging within the `datadog-sidecar`, including a mechanism for efficiently managing multiple `tracing` environment filters and a custom log formatter.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Igor Unanua",
            "percent": 29
          },
          {
            "name": "Ganesh Jangir",
            "percent": 22
          },
          {
            "name": "Julio Gonzalez",
            "percent": 20
          }
        ]
      },
      "Custom Memory Management & Allocators": {
        "files": [
          {
            "path": "libdd-alloc/README.md",
            "description": "This README provides an overview of libdd-alloc, which offers specialized memory allocators for constrained and performance-critical environments. It details features like no_std compatibility, various allocator types, and its allocator API.",
            "spof": true
          },
          {
            "path": "libdd-alloc/src/chain.rs",
            "description": "This file implements `ChainAllocator`, an arena allocator that manages memory by chaining multiple `LinearAllocator` instances. It allows for efficient bulk memory allocation where individual deallocations are not supported.",
            "spof": false
          },
          {
            "path": "libdd-alloc/src/virtual_alloc.rs",
            "description": "Provides a platform-agnostic virtual memory allocator (`VirtualAllocator`) that allocates memory in whole page sizes, suitable for large allocations or as a backing for other allocators.",
            "spof": false
          },
          {
            "path": "libdd-alloc/src/utils.rs",
            "description": "This file provides utility functions primarily used for testing memory allocators. It includes a helper for checking pointer alignment and a function to assist in fuzzing allocator behavior.",
            "spof": false
          },
          {
            "path": "libdd-alloc/src/linear.rs",
            "description": "This file implements a `LinearAllocator`, which is an arena allocator that performs allocations from a pre-allocated memory block and deallocates all memory at once when the allocator is dropped.",
            "spof": false
          },
          {
            "path": "libdd-alloc/src/lib.rs",
            "description": "This file defines the core `libdd-alloc` library, providing `no_std` compatible custom memory allocators, including linear, chained, and virtual allocation strategies. It exposes these allocators via the `allocator_api2` interface.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/collections/string_table/error.rs",
            "description": "Defines an `Error` enum for the string table collection, including variants for out-of-memory and storage-full conditions, along with conversions from various allocation errors.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/collections/string_table/mod.rs",
            "description": "This file defines a `StringTable` data structure that efficiently stores unique strings and assigns them stable `StringId`s based on their insertion order, utilizing an arena allocator for memory management. It also provides an `ArenaAllocator` trait for memory-efficient string storage.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/profiles/collections/arc.rs",
            "description": "Implements a custom, fallible, and panic-free atomic reference counter (Arc) similar to `std::sync::Arc`, designed for environments where panics or aborts are undesirable, with support for custom allocators.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Levi Morrison",
            "percent": 96
          },
          {
            "name": "Julio Gonzalez",
            "percent": 4
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 163,
      "spofCount": 63
    },
    "busFactor": 4,
    "authorCount": 19
  },
  "APM & Distributed Tracing": {
    "description": "Provides end-to-end visibility into application requests, tracing them across microservices to monitor performance, identify latency sources, and troubleshoot complex issues in distributed systems.",
    "functions": {
      "Trace Data Serialization & Deserialization": {
        "files": [
          {
            "path": "libdd-trace-protobuf/CHANGELOG.md",
            "description": "This file documents the version history and changes made to the libdd-trace-protobuf project, with entries for each release.",
            "spof": false
          },
          {
            "path": "libdd-trace-protobuf/src/deserializers.rs",
            "description": "This file provides utility functions for `serde` deserialization, designed to handle common data inconsistencies such as null values, default assignments, and sanitizing numerical inputs like durations.",
            "spof": true
          },
          {
            "path": "libdd-trace-protobuf/src/pb_test.rs",
            "description": "This file contains unit tests for Protobuf-related structs, specifically focusing on their JSON serialization and deserialization, as well as a utility function for checking default values. It ensures the correct handling of `Span` and `ClientStatsPayload` data structures.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/benches/deserialization.rs",
            "description": "This file contains benchmarks for deserializing trace data from MessagePack format into the internal data structure, primarily focusing on the performance of the `decode_to_trace_chunks` function.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/benches/main.rs",
            "description": "This file serves as the main entry point for Criterion benchmarks, specifically orchestrating performance tests for serialization and deserialization operations within the `libdd-trace-utils` library.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/benches/serialization.rs",
            "description": "This file contains benchmarks for serializing trace data from an internal representation into MessagePack format using the `libdd-trace-utils` library.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/tracer_header_tags.rs",
            "description": "This file defines the `TracerHeaderTags` struct for managing and converting tracing-related metadata (e.g., language, version, container ID) between a Rust struct and HTTP headers or HashMaps.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/trace_utils.rs",
            "description": "This file provides utilities for deserializing trace payloads from HTTP request bodies. It handles both general MessagePack and Datadog's v0.5 trace format, which includes a string dictionary for optimized parsing of span data.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/mod.rs",
            "description": "This file acts as the top-level module for MsgPack decoding utilities, organizing different decoding versions (v04, v05) and general decoding logic.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/metrics.rs",
            "description": "This file provides functions for decoding metric key-value pairs (string to float) and collections of metrics (HashMap) from a MessagePack-encoded buffer.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/span_link.rs",
            "description": "This file contains functions responsible for decoding MessagePack-encoded SpanLink objects from a byte buffer. It handles parsing individual span link fields and assembling them into `SpanLink` structs.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/span_event.rs",
            "description": "This file provides functions for decoding MessagePack-encoded span events and their nested attributes into `SpanEvent` objects, typically used in distributed tracing.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/buffer.rs",
            "description": "This file defines a `Buffer` struct for wrapping and managing MessagePack encoded trace data. It provides utilities for decoding MessagePack strings and manipulating the underlying byte buffer during the decoding process.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/mod.rs",
            "description": "This module serves as the central entry point for decoding various MessagePack (msgpack) data structures, organizing specific decoding logic into sub-modules.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/decode/meta_struct.rs",
            "description": "This file decodes MessagePack-encoded metadata structures, typically used in tracing, into a HashMap of string keys to byte array values. It handles the parsing of map lengths, string keys, and binary data values from a buffer.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/v04/span.rs",
            "description": "Decodes MessagePack-encoded data into version 0.4 `Span` objects for Datadog traces, mapping keys to the corresponding span fields.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/v04/mod.rs",
            "description": "This module provides functions for decoding MessagePack-encoded data representing v04 Datadog trace spans, converting them into structured Rust objects from byte buffers or slices.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/msgpack_decoder/v05/mod.rs",
            "description": "This module provides functions for decoding MessagePack-encoded tracing payloads (v0.5 format) into Rust `Span` objects, handling dictionary-indexed strings and various data types.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_encoder/mod.rs",
            "description": "This file serves as the main module for MessagePack encoding utilities, specifically exposing the 'v04' implementation.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/msgpack_encoder/v04/span.rs",
            "description": "This file provides functions to encode Datadog trace span data structures, including spans, span links, and span events, into the MessagePack format (v04).",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/msgpack_encoder/v04/mod.rs",
            "description": "This file provides utilities for encoding Datadog trace data (collections of spans) into the MessagePack format. It includes functions to write encoded traces to byte slices or vectors, and to calculate the size of the encoded data without allocation, adhering to a v04 schema.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/span/v05/dict.rs",
            "description": "This file defines a `SharedDict` struct used for interning strings within a v05 trace chunk. It efficiently stores strings once and provides methods to get or insert them, returning a unique index.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/tests/snapshots",
            "description": "This directory is intended to store test snapshots for the `libdd-data-pipeline` component. These snapshots are typically used in conjunction with automated tests to verify that outputs or states match a previously recorded baseline.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/src/trace_exporter/trace_serializer.rs",
            "description": "This file implements a `TraceSerializer` responsible for preparing and serializing trace data into Msgpack format, along with generating the necessary HTTP headers, for transmission to a Datadog agent. It supports different trace payload versions (V04/V05).",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/service/serialized_tracer_header_tags.rs",
            "description": "This file defines `SerializedTracerHeaderTags` and provides conversion implementations (using `bincode`) for serializing and deserializing `TracerHeaderTags` to and from a byte vector.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 77
          },
          {
            "name": "shreyamalpani",
            "percent": 11
          },
          {
            "name": "Jordan Storms",
            "percent": 6
          }
        ]
      },
      "Trace & Span Data Modeling": {
        "files": [
          {
            "path": "libdd-trace-protobuf/README.md",
            "description": "This file is the README for `libdd-trace-protobuf`, a library providing Protocol Buffer definitions and Rust serialization support for Datadog APM trace data.",
            "spof": true
          },
          {
            "path": "libdd-trace-protobuf/src/pb.idx.rs",
            "description": "This file contains Rust struct definitions generated from Protocol Buffers, primarily defining data structures for distributed tracing, including spans, events, and trace chunks.",
            "spof": false
          },
          {
            "path": "libdd-trace-protobuf/src/pb.rs",
            "description": "This file contains auto-generated Rust data structures from Protocol Buffer definitions for tracing components such as spans, span links, and attribute values. It facilitates serialization and deserialization of these tracing data types.",
            "spof": false
          },
          {
            "path": "libdd-trace-protobuf/src/pb/idx",
            "description": "This directory is intended to house Protocol Buffer (protobuf) definitions or generated files specifically related to indexing functionalities within the `libdd-trace-protobuf` library. Although currently empty, its structure suggests it's a placeholder for future indexing-related protobuf schemas or compiled output.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/trace.rs",
            "description": "This file provides core data structures and utilities for distributed tracing, including `Context`, `TraceId`, `SpanId`, and `SamplingDecision`, with support for OpenTelemetry integration.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/context.rs",
            "description": "This file defines the `Context` struct used in RPC calls to carry request-scoped information such as deadlines and tracing context. It enables distributed tracing and allows the server to enforce response deadlines for incoming requests.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/CHANGELOG.md",
            "description": "This file serves as a changelog, documenting all notable changes and releases for the `libdd-trace-utils` library within the `libdatadog` project.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/tracer_payload.rs",
            "description": "This file defines data structures and utilities for handling and processing different versions (v0.4, v0.5, v0.7) of Datadog trace payloads, including encoding, decoding, appending, and merging trace data.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/test_utils/mod.rs",
            "description": "This module provides utility functions for creating various types of test spans and other helpers, specifically designed for use in test code within the `libdd-trace-utils` crate.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/span/mod.rs",
            "description": "This module defines fundamental traits and data structures for representing and deserializing span-related text and byte data, offering flexible handling for different memory ownership models. It serves as the base for span functionalities and versioned data structures.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/span/v05/mod.rs",
            "description": "This file defines the `v05` Span data structure for Datadog traces, which uses string interning via a shared dictionary for its textual fields. It also provides a conversion function from the `v04` Span format to this `v05` structure.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/span/v04/mod.rs",
            "description": "This file defines the data structures (`Span`, `SpanLink`, `SpanEvent`, etc.) used to represent Datadog trace spans, span links, and span events according to the V04 trace protocol. It includes the serialization logic for these structures.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 97
          },
          {
            "name": "Julio Gonzalez",
            "percent": 1
          },
          {
            "name": "Igor Unanua",
            "percent": 1
          }
        ]
      },
      "Cross-Language FFI Bindings": {
        "files": [
          {
            "path": "libdd-library-config/src/tracer_metadata.rs",
            "description": "This file defines the `TracerMetadata` struct for storing details about a tracing library and its instrumented service. It also provides platform-specific functionality (utilizing Linux memfd) to serialize and store this metadata in an anonymous, in-memory file.",
            "spof": false
          },
          {
            "path": "examples/ffi/trace_exporter.c",
            "description": "This file is an example C program demonstrating the use of the Datadog FFI (Foreign Function Interface) for configuring logging and exporting traces, including telemetry setup.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline-ffi/README.md",
            "description": "This README provides an overview of the `libdd-data-pipeline-ffi` library, which offers C-compatible FFI bindings for `libdd-data-pipeline`. Its purpose is to enable high-performance trace processing across various programming languages such as C, C++, PHP, Ruby, and Python.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline-ffi/src/response.rs",
            "description": "This file defines an FFI-compatible structure (`ExporterResponse`) for handling agent responses to trace payloads. It provides C-callable functions to access the response body and to free the allocated response memory, facilitating interoperability.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline-ffi/src/trace_exporter.rs",
            "description": "This file provides the Foreign Function Interface (FFI) bindings for configuring a trace exporter, allowing other languages to interact with the trace exporter's settings in `libdatadog`.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline-ffi/src/error.rs",
            "description": "This file defines C-compatible error codes and a C-compatible error structure (`ExporterError`) for the `libdd-data-pipeline-ffi` library. It provides conversion logic from internal Rust `TraceExporterError` types to this FFI-friendly format and a C-exposed function for freeing error memory.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline-ffi/src/lib.rs",
            "description": "This file serves as the main library entry point for the `libdd-data-pipeline-ffi` Rust crate, organizing core modules for error handling, response structures, and a trace exporter to facilitate Foreign Function Interface (FFI) interactions.",
            "spof": false
          },
          {
            "path": "datadog-sidecar-ffi/src/span.rs",
            "description": "This file provides a Foreign Function Interface (FFI) for managing Datadog trace spans, including functions for creating, accessing, and modifying span data, metadata, and metrics.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/README.md",
            "description": "This file is the README for the `libdd-data-pipeline` project, a high-performance Rust library for processing and exporting APM tracing data to Datadog. It details the project's purpose, architecture, API, and instructions for integration into different language tracers.",
            "spof": false
          },
          {
            "path": "libdd-library-config-ffi/src/tracer_metadata.rs",
            "description": "This file defines the C-compatible Foreign Function Interface (FFI) for managing tracer metadata. It allows C-compatible clients to create, manipulate, and store tracer metadata, primarily for sharing via memory-mapped files (like `memfd` on Linux).",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Alexandre Rulleau",
            "percent": 77
          },
          {
            "name": "Ganesh Jangir",
            "percent": 10
          },
          {
            "name": "Julio Gonzalez",
            "percent": 5
          }
        ]
      },
      "Trace Normalization": {
        "files": [
          {
            "path": "libdd-trace-normalization/README.md",
            "description": "This README provides an overview of libdd-trace-normalization, a library designed for normalizing and validating distributed tracing data for Datadog APM.",
            "spof": true
          },
          {
            "path": "libdd-trace-normalization/CHANGELOG.md",
            "description": "This file documents all notable changes, new features, and bug fixes for each version of the libdd-trace-normalization library.",
            "spof": true
          },
          {
            "path": "libdd-trace-normalization/benches/normalization_utils.rs",
            "description": "This file contains benchmarks for the trace normalization utilities provided by the `libdd-trace-normalization` crate, specifically for normalizing service names, span names, and entire traces.",
            "spof": false
          },
          {
            "path": "libdd-trace-normalization/src/lib.rs",
            "description": "This Rust library provides core functionalities for normalizing trace data, including utility functions for string handling and the main normalization logic. It also includes conditional modules for fuzz testing the normalization processes.",
            "spof": true
          },
          {
            "path": "libdd-trace-normalization/src/normalize_utils.rs",
            "description": "Provides utility functions for normalizing various tracing data fields like span names, service names, tags, and timestamps, ensuring they conform to defined formats and length limits. It handles string truncation, character case conversion, and invalid character replacement.",
            "spof": true
          },
          {
            "path": "libdd-trace-normalization/src/fuzz.rs",
            "description": "This file provides fuzzing infrastructure for the `normalize_span` function, generating arbitrary `pb::Span` data to test its robustness and catch potential issues like panics or crashes.",
            "spof": true
          },
          {
            "path": "libdd-trace-normalization/src/normalizer.rs",
            "description": "This file contains functions responsible for normalizing Datadog trace spans and trace chunks. It performs data validation, sanitization, and ensures consistency of trace data fields according to Datadog's standards.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Edouard Schweisguth",
            "percent": 88
          },
          {
            "name": "vianney",
            "percent": 8
          },
          {
            "name": "Igor Unanua",
            "percent": 2
          }
        ]
      },
      "Trace Export & Transport": {
        "files": [
          {
            "path": "datadog-ipc/tarpc/src/client/in_flight_requests.rs",
            "description": "Manages in-flight requests that have been sent over the wire but have not yet received responses, handling their insertion, completion, cancellation, and deadline expiration. It tracks request data, deadlines, and associated spans for tracing.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/examples/readme.rs",
            "description": "This file provides an example demonstrating how to define and use a remote procedure call (RPC) service named 'World' with the 'tarpc' library, including both server and client implementations.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/examples/tracing.rs",
            "description": "This file provides an example of setting up `tarpc` services with inter-service communication, specifically demonstrating how to integrate and use distributed tracing with OpenTelemetry and Jaeger for RPC calls.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/README.md",
            "description": "This README describes `libdd-trace-utils`, a library providing essential utilities for distributed tracing. It covers span processing, serialization, and data transport to Datadog APM, including MessagePack encoding and HTTP transport with retry logic.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/lib.rs",
            "description": "This file serves as the root for a Rust utility library, providing modules for configuration, MsgPack encoding/decoding, sending data with retry logic, trace utilities, and span management for Datadog's tracing ecosystem.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/send_data/send_data_result.rs",
            "description": "This file defines the `SendDataResult` struct, which is used to aggregate metrics and the last request result from sending data, including counts for requests, responses, errors, bytes, and data chunks.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/send_data/mod.rs",
            "description": "This module defines the `SendData` struct and related logic for sending tracer payloads to a target endpoint. It handles serialization (Protobuf or MessagePack), compression, and retry mechanisms for reliable data transmission.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/CHANGELOG.md",
            "description": "This file is the changelog for the 'libdd-data-pipeline' component of the 'libdatadog' repository, documenting its version history and updates. It currently shows the initial release at version 1.0.0.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/tests/test_trace_exporter.rs",
            "description": "This file contains integration tests for the trace exporter, verifying its functionality with different trace payload formats (v0.4 and v0.5) by sending them to a test agent and asserting against snapshots.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/examples/send-traces-with-stats.rs",
            "description": "This file is an example demonstrating how to use `libdd_data_pipeline` to generate and send traces, along with associated statistics, to a Datadog Trace Agent.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/src/stats_exporter.rs",
            "description": "This file defines the `StatsExporter` struct, which is responsible for collecting and periodically sending trace statistics, concentrated by a `SpanConcentrator`, to the Datadog agent.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/src/lib.rs",
            "description": "This Rust library provides an MVP (Minimum Viable Product) `TraceExporter` for sending traces to agents. It aims to offer a basic API for testing integration across different languages.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/src/trace_exporter/error.rs",
            "description": "This file defines a comprehensive set of error types for the trace exporter, encapsulating various issues such as agent communication, network problems, serialization/deserialization failures, and internal errors. It provides a unified error handling mechanism for the trace export process.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/src/trace_exporter/mod.rs",
            "description": "This module defines the core `TraceExporter` component, responsible for ingesting, serializing, and forwarding traces to the Datadog agent, including handling different trace formats, metrics, and worker management.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/src/trace_exporter/metrics.rs",
            "description": "This file defines a `MetricsEmitter` responsible for sending health metrics, such as counts and distributions, to DogStatsD. It handles the emission of metrics based on `HealthMetric` and `SendResult` types, incorporating common and custom tags.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/tracer.rs",
            "description": "This file defines the configuration for a Datadog tracer within the sidecar, including handling endpoints and initializing a shared memory rate limiter.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/tracing/mod.rs",
            "description": "This file serves as the module entry point for tracing functionality within the `datadog-sidecar` service, organizing and exposing components for flushing and sending trace data.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/tracing/trace_flusher.rs",
            "description": "This file defines the `TraceFlusher` component, which is responsible for asynchronously collecting, batching, and sending tracing data to a configured agent or endpoint, while also managing associated metrics and agent remote configurations.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Jules Wiriath",
            "percent": 59
          },
          {
            "name": "Bob Weinand",
            "percent": 22
          },
          {
            "name": "Bryan English",
            "percent": 6
          }
        ]
      },
      "Trace Statistics Aggregation & Sampling": {
        "files": [
          {
            "path": "libdd-trace-utils/src/stats_utils.rs",
            "description": "This file provides utility functions for handling trace statistics, including deserializing incoming stats, constructing aggregate payloads, serializing them using MessagePack and Gzip, and sending them via HTTP, primarily for a 'mini_agent' feature.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/span/trace_utils.rs",
            "description": "This file implements utility functions for processing and manipulating tracing spans, including determining top-level status, checking various span properties, and filtering/dropping trace chunks based on sampling rules.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/src/trace_exporter/stats.rs",
            "description": "This module manages the lifecycle and functionality of client-side statistics computation for the trace exporter, including starting/stopping stats workers, concentrating spans, and processing traces for stats collection and dropping P0 traces.",
            "spof": true
          },
          {
            "path": "libdd-trace-stats/CHANGELOG.md",
            "description": "This file is a changelog for the `libdd-trace-stats` library, documenting all notable changes and version releases over time.",
            "spof": true
          },
          {
            "path": "libdd-trace-stats/README.md",
            "description": "This README describes `libdd-trace-stats`, a library designed to compute aggregated statistics from distributed tracing spans. It focuses on time-bucketed aggregation, DDSketch integration for latency metrics, and preparing data for the Datadog backend.",
            "spof": true
          },
          {
            "path": "libdd-trace-stats/benches/main.rs",
            "description": "This file serves as the main entry point for running benchmarks for the `span_concentrator` module within the `libdd-trace-stats` library, utilizing the Criterion benchmarking framework.",
            "spof": false
          },
          {
            "path": "libdd-trace-stats/benches/span_concentrator_bench.rs",
            "description": "Benchmarks for the `SpanConcentrator` component, measuring the performance of adding a large number of synthetic spans.",
            "spof": true
          },
          {
            "path": "libdd-trace-stats/src/lib.rs",
            "description": "This file is the main library entry point for the `libdd-trace-stats` crate, providing utilities for computing statistics from traces. It specifically exports a `span_concentrator` module.",
            "spof": false
          },
          {
            "path": "libdd-trace-stats/src/span_concentrator/mod.rs",
            "description": "This module implements the `SpanConcentrator` struct, which aggregates trace spans into time-based statistics buckets based on various span attributes and eligibility criteria. It allows for the flushing of these aggregated statistics.",
            "spof": false
          },
          {
            "path": "libdd-trace-stats/src/span_concentrator/stat_span.rs",
            "description": "This module defines a common interface (`StatSpan` trait) for different span types (from `trace-utils` and `protobuf`) to allow uniform statistics computation, abstracting away their underlying data structures.",
            "spof": true
          },
          {
            "path": "libdd-trace-stats/src/span_concentrator/aggregation.rs",
            "description": "This module implements the logic for aggregating span statistics into time buckets, using aggregation keys to group spans and compute their metrics. It defines structures for aggregation keys and grouped statistics within these time buckets.",
            "spof": true
          },
          {
            "path": "libdd-trace-stats/src/span_concentrator/tests.rs",
            "description": "This file contains unit tests for the `SpanConcentrator` component, verifying its behavior in aggregating span statistics over different time buckets and handling various timestamp scenarios.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Igor Unanua",
            "percent": 34
          },
          {
            "name": "Bob Weinand",
            "percent": 29
          },
          {
            "name": "Edmund Kump",
            "percent": 15
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 84,
      "spofCount": 44
    },
    "busFactor": 2,
    "authorCount": 14
  },
  "Dynamic Instrumentation & Remote Configuration": {
    "description": "Allows operators to dynamically adjust monitoring rules and behavior for live applications without requiring a redeployment, enabling real-time control over data collection and security policies.",
    "functions": {
      "Remote Configuration Polling & State Management": {
        "files": [
          {
            "path": "libdd-trace-protobuf/src/remoteconfig.rs",
            "description": "This file defines Rust data structures generated from Protocol Buffer definitions, used for handling remote configuration messages within the Datadog tracing library.",
            "spof": true
          },
          {
            "path": "libdd-library-config/CHANGELOG.md",
            "description": "This file documents all notable changes and new features introduced in different versions of the `libdd-library-config` component.",
            "spof": true
          },
          {
            "path": "datadog-remote-config/examples/remote_config_fetch.rs",
            "description": "This file is an example demonstrating how to use the `datadog_remote_config` crate in Rust to continuously fetch and process remote configuration changes for a single target application. It initializes a fetcher and periodically polls for updates, printing details of added, updated, or removed configuration files.",
            "spof": true
          },
          {
            "path": "datadog-remote-config/src/file_storage.rs",
            "description": "This file defines a generic, in-memory storage system for remote configuration files, supporting both raw byte storage and parsing into structured data, along with mechanisms to track file updates.",
            "spof": false
          },
          {
            "path": "datadog-remote-config/src/parse.rs",
            "description": "This file defines data structures and parsing logic for various types of remote configuration data, converting raw bytes into structured Rust enums based on the configuration product type. It handles parsing of agent configurations, dynamic configurations, and feature flags from remote sources.",
            "spof": false
          },
          {
            "path": "datadog-remote-config/src/lib.rs",
            "description": "This file defines the core structures and modules for Datadog's Remote Configuration system, including definitions for configuration targets and various remote-configurable capabilities like ASM and APM features.",
            "spof": false
          },
          {
            "path": "datadog-remote-config/src/file_change_tracker.rs",
            "description": "This file implements a generic change tracking mechanism for files based on their paths. It can detect additions, removals, and content updates between successive snapshots of a set of files.",
            "spof": false
          },
          {
            "path": "datadog-remote-config/src/path.rs",
            "description": "Defines data structures and utilities for representing, parsing, and managing paths to remote configuration items in the Datadog ecosystem, categorizing them by source and product.",
            "spof": false
          },
          {
            "path": "datadog-remote-config/src/fetch/mod.rs",
            "description": "This module acts as the public interface for the remote configuration fetching functionality, re-exporting various fetching strategies and shared components.",
            "spof": false
          },
          {
            "path": "datadog-remote-config/src/fetch/shared.rs",
            "description": "This file implements the `SharedFetcher` and `RefcountingStorage` components, which are central to the remote configuration fetching system. It manages the lifecycle, reference counting, and state of configuration files to ensure efficient and correct handling of remote configurations.",
            "spof": false
          },
          {
            "path": "datadog-remote-config/src/fetch/test_server.rs",
            "description": "Implements a mock HTTP server for testing the Datadog remote configuration client. This server simulates the remote configuration service, allowing controlled responses and request inspection in test environments.",
            "spof": true
          },
          {
            "path": "datadog-remote-config/src/fetch/fetcher.rs",
            "description": "This file implements the `ConfigFetcher` responsible for fetching, managing, and storing remote configuration files, handling their lifecycle including storage, updates, and expiration.",
            "spof": false
          },
          {
            "path": "datadog-remote-config/src/fetch/single.rs",
            "description": "This file implements `SingleFetcher` for one-time remote configuration fetching and `SingleChangesFetcher` for fetching and tracking changes in remote configurations, utilizing a `ConfigFetcher`.",
            "spof": true
          },
          {
            "path": "datadog-remote-config/src/config/mod.rs",
            "description": "This file serves as the main module for the `config` components within the `datadog-remote-config` crate. It declares sub-modules related to agent configuration, agent tasks, and dynamic settings.",
            "spof": true
          },
          {
            "path": "datadog-remote-config/src/config/dynamic.rs",
            "description": "This file defines data structures for deserializing and managing dynamic configuration settings related to Datadog's tracing, logging, and instrumentation features, typically received from a remote configuration service.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 51
          },
          {
            "name": "Edmund Kump",
            "percent": 20
          },
          {
            "name": "Igor Unanua",
            "percent": 7
          }
        ]
      },
      "Configuration Application & FFI": {
        "files": [
          {
            "path": "libdd-library-config/README.md",
            "description": "This README describes 'libdd-library-config', a configuration management library for Datadog products that handles reading and managing settings from multiple sources with precedence rules.",
            "spof": true
          },
          {
            "path": "libdd-library-config/src/lib.rs",
            "description": "This file provides functionality for loading, matching, and templating library configurations based on process-specific information like arguments, environment variables, and tags. It includes structures for gathering process details, evaluating selectors, and applying template variables to configuration strings.",
            "spof": true
          },
          {
            "path": "examples/ffi/library_config.c",
            "description": "This C example demonstrates how to use the `libdatadog` FFI to retrieve and apply library configurations based on command-line arguments, process information, and local/fleet paths. It initializes a configurator, fetches configurations, logs output, and sets environment variables accordingly.",
            "spof": true
          },
          {
            "path": "libdd-library-config-ffi/src/lib.rs",
            "description": "This file provides the Foreign Function Interface (FFI) bindings for managing and retrieving library configurations in Datadog projects. It exposes functions to initialize a configurator, set paths and process information, and fetch configurations, including error handling and panic catching for FFI calls.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Victor Pellan",
            "percent": 60
          },
          {
            "name": "paullegranddc",
            "percent": 21
          },
          {
            "name": "Julio Gonzalez",
            "percent": 6
          }
        ]
      },
      "Inter-Process Configuration Delivery & Injection": {
        "files": [
          {
            "path": "datadog-sidecar/src/shm_remote_config.rs",
            "description": "This file manages the storage and retrieval of remote configurations using shared memory (SHM) for inter-process communication within the Datadog sidecar. It defines structures and logic for writing and reading configuration data to/from SHM for various targets and products, including dynamic instrumentation.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/service/remote_configs.rs",
            "description": "This file manages remote configurations for multiple runtimes/processes, handling their lifecycle, shared memory storage, and OS-specific notification mechanisms for configuration updates.",
            "spof": true
          },
          {
            "path": "spawn_worker/src/trampoline.c",
            "description": "This file implements a trampoline executable that loads a specified shared library, its dependencies, and then executes a designated function within that library, passing it startup data including command-line arguments.",
            "spof": true
          },
          {
            "path": "spawn_worker/src/ld_preload_trampoline.c",
            "description": "This file implements an LD_PRELOAD-based mechanism to hijack an executable's entry point, allowing an alternative `main` function (`main_override`) to be called instead of the original, which can then execute a specified symbol from the target program.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 79
          },
          {
            "name": "Edmund Kump",
            "percent": 15
          },
          {
            "name": "Levi Morrison",
            "percent": 3
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 23,
      "spofCount": 14
    },
    "busFactor": 4,
    "authorCount": 11
  },
  "Continuous Profiling": {
    "description": "Collects and analyzes code performance data from production environments to help developers identify and resolve performance bottlenecks with minimal overhead.",
    "functions": {
      "PProf Data Serialization & Tooling": {
        "files": [
          {
            "path": "libdd-profiling-protobuf/README.md",
            "description": "This README describes `libdd-profiling-protobuf`, which provides Rust types and serialization support for Google's pprof protocol buffer format, used for profiling data.",
            "spof": true
          },
          {
            "path": "libdd-profiling-protobuf/CHANGELOG.md",
            "description": "This file is a changelog that documents the version history and significant changes made to the `libdd-profiling-protobuf` component. It currently details the initial release.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/location.rs",
            "description": "This file defines Rust data structures (`Location` and `Line`) for representing profiling debug information, specifically function and line numbers, enabling their serialization and deserialization via Protobuf.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/function.rs",
            "description": "This file defines the `Function` struct used to represent function metadata within Datadog's profiling protobuf implementation, handling its serialization and deserialization.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/lib.rs",
            "description": "This crate provides streaming Protobuf encoders for individual profile data structures, allowing efficient serialization to a `Write` stream without encoding full `Profile` messages.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/prost_impls.rs",
            "description": "This file defines the Rust data structures for Protobuf messages used in profiling, generated or compatible with the `prost` crate.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/string.rs",
            "description": "This file defines the `StringOffset` type, a u32 wrapper representing an offset into a string table for profiling data, along with its serialization logic for protobuf and various integer conversions.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/value_type.rs",
            "description": "Defines the `ValueType` struct, which describes the semantics and measurement units of a value, and provides its Protocol Buffers encoding/decoding logic and conversions to/from `prost` generated types.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/mapping.rs",
            "description": "This file defines the `Mapping` struct, which represents a memory mapping within a profiling context, including its address range, file offset, filename, and build ID. It provides custom protobuf-like serialization/deserialization for this structure and conversions to/from `prost`-generated types.",
            "spof": false
          },
          {
            "path": "libdd-profiling-protobuf/src/sample.rs",
            "description": "This file defines the `Sample` struct, which represents a single sample of profiling data for efficient Protobuf encoding and decoding. It facilitates the conversion between its internal representation and `prost`-generated Protobuf messages.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/internal/profile/fuzz_tests.rs",
            "description": "This file defines data structures and helper functions used to generate and validate profiling data for fuzz testing the `libdd-profiling` library. It includes structs for functions, labels, locations, mappings, and samples, along with conversion logic and assertion utilities for testing profile serialization and consistency.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/collections/string_table/wordpress_test_data.rs",
            "description": "This file contains a static array of strings extracted from a WordPress profile, intended for use in tests to avoid the overhead of decompressing and parsing profile data dynamically.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/profiles/fallible_string_writer.rs",
            "description": "This file defines `FallibleStringWriter`, a `fmt::Write` adapter that wraps a `String` and uses fallible memory allocation (`try_reserve`) before each write operation, returning a `fmt::Error` if allocation fails.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/compressor.rs",
            "description": "This file defines traits and implementations for compressing profiling and observation data, primarily using Zstd, with a size-restricted buffer. It provides a flexible mechanism to encode and decode data while managing memory limits.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/pprof/mod.rs",
            "description": "This file serves as the main module for the `pprof` (profiling) component, primarily exposing testing utilities for the module when in test configurations.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/pprof/test_utils.rs",
            "description": "This file provides utility functions for testing and manipulating `pprof` profiles, including (de)serialization of compressed profiles, sorting samples, and accessing strings from the profile's string table.",
            "spof": true
          },
          {
            "path": "libdd-profiling/tests/wordpress.rs",
            "description": "This file contains a Rust test that validates the parsing and conversion of a PHP performance profile (in pprof format) into the internal libdd-profiling API format.",
            "spof": true
          },
          {
            "path": "libdd-profiling/examples/profiles.rs",
            "description": "This file is an example demonstrating how to use `libdd-profiling` to programmatically create a sample profiling report with specific call stack information, and then serialize it into a compressed pprof format, writing the output to standard out.",
            "spof": true
          },
          {
            "path": "datadog-profiling-replayer/src/replayer.rs",
            "description": "This file defines the `Replayer` struct, which is responsible for parsing and transforming a Protobuf-encoded Datadog profile into a structured format suitable for replaying or analysis using the `libdatadog` profiling API.",
            "spof": false
          },
          {
            "path": "datadog-profiling-replayer/src/main.rs",
            "description": "This file implements a command-line tool for replaying and analyzing Datadog profiling data. It reads an input pprof file, reconstructs an internal profile, and can output the result, collect memory statistics, and report on stack depth distributions.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Levi Morrison",
            "percent": 60
          },
          {
            "name": "Daniel Schwartz-Narbonne",
            "percent": 25
          },
          {
            "name": "Julio Gonzalez",
            "percent": 5
          }
        ]
      },
      "Profile Aggregation & In-Memory Representation": {
        "files": [
          {
            "path": "libdd-profiling-protobuf/src/label.rs",
            "description": "Defines the `Label` struct used to represent contextual metadata for profiling samples, including its serialization logic for a custom Protobuf format and conversion to a `prost`-generated Protobuf type.",
            "spof": false
          },
          {
            "path": "libdd-profiling/README.md",
            "description": "This README describes `libdd-profiling`, a core library for collecting, aggregating, and exporting continuous profiling data in pprof format to Datadog backends. It details its features, modules, and example usage for managing and sending various types of profiling information.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/iter.rs",
            "description": "This file defines custom `LendingIterator` and `IntoLendingIterator` traits. These traits enable iterating over items that borrow references from the iterator itself, specifically designed for use within the profiler library.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/lib.rs",
            "description": "This file serves as the main entry point for the `libdd-profiling` Rust library, defining its top-level modules for various profiling functionalities like API, exporter, and pprof.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/api2.rs",
            "description": "This file defines core data structures, `Location2` and `Label`, used to represent profiling locations and associated key-value labels within version 2 of the `libdatadog` profiling API.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/internal/endpoints.rs",
            "description": "This file defines the `Endpoints` struct, which manages and stores information about profiled endpoints within the `libdatadog` library, including their mappings and statistics.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/sample.rs",
            "description": "This file defines the `Sample` struct, which represents a profiling sample containing label context and a stack trace. It also defines `SampleId` for unique identification of these samples within the profiling system.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/mapping.rs",
            "description": "This file defines the `Mapping` struct and `MappingId` type, which represent memory mappings within a profiling context, optimized for space efficiency compared to the standard `pprof::Mapping`.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/stack_trace.rs",
            "description": "This file defines the `StackTrace` struct, which represents a sequence of code locations, and its associated identifier type, `StackTraceId`, for use within a profiling system.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/upscaling.rs",
            "description": "This file defines data structures and logic for applying upscaling rules to profiling data, including calculating scaling factors based on different strategies (e.g., Poisson or proportional) and managing collision detection between rules.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/internal/endpoint_stats.rs",
            "description": "This file defines a `ProfiledEndpointsStats` struct that tracks and aggregates counts for different profiled endpoints, intended for serialization and reporting.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/timestamp.rs",
            "description": "This file defines the `Timestamp` type as a `std::num::NonZeroI64`. It establishes the internal representation for timestamps within the `libdd-profiling` library.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/location.rs",
            "description": "This file defines the `Location` struct, an optimized, space-saving representation of a pprof::Location specific to libdatadog profiling, along with its corresponding `LocationId` for unique identification.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/mod.rs",
            "description": "This file serves as the module declaration for the `internal` module of `libdd-profiling`, defining and re-exporting core data structures and logic related to profiling components such as endpoints, functions, labels, locations, and samples.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/internal/label.rs",
            "description": "This file defines data structures for profiling labels, including their values (string or numeric with unit), and mechanisms for identifying individual labels and sets of labels. It also provides conversions for serialization into Protobuf formats.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/function.rs",
            "description": "Defines the `Function` struct and its associated `FunctionId` for representing profiled functions within libdatadog, optimized for space efficiency.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/internal/observation/timestamped_observations.rs",
            "description": "This file defines a mechanism to store and retrieve timestamped observations (samples, timestamps, and values) in a compressed buffer, optimizing for memory usage until the data needs to be serialized. It uses a configurable codec for compression and decompression.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/observation/trimmed_observation.rs",
            "description": "This file defines `ObservationLength` and `TrimmedObservation`, a memory-efficient, pointer-based representation of `Vec<i64>` used internally by map types to store sample observations without redundant length/capacity metadata.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/observation/observations.rs",
            "description": "This file defines structures for storing and managing profiling observations. It aggregates observations without timestamps while keeping timestamped observations separate, providing an interface to add, count, and iterate over them.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/internal/observation/mod.rs",
            "description": "This module provides internal structures and logic for optimizing memory usage when storing observation data within the profiler. It focuses on reducing the overhead of `i64` value lists associated with profile samples.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/profile/profiles_dictionary_translator.rs",
            "description": "This file defines `ProfilesDictionaryTranslator`, which translates external IDs from a `ProfilesDictionary` into the internal ID representation used by the current profile's collections, handling deduplication and string interning.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/internal/profile/mod.rs",
            "description": "This module defines the core `Profile` data structure and its associated methods for collecting, managing, and adding various types of profiling samples and metadata within the `libdd-profiling` library.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/internal/profile/interning_api/mod.rs",
            "description": "This file defines methods for the `Profile` struct to intern various profiling data elements (like strings, functions, locations, and samples) efficiently, typically involving deduplication and generational IDs. It also includes mechanisms for synchronizing sample collection with profile rotation or export operations.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/api/sample_type.rs",
            "description": "This file defines the `SampleType` enum, which enumerates the various profiling sample types supported across Datadog's profilers. It includes conversion logic between `SampleType` and a more generic `ValueType`.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/api/mod.rs",
            "description": "This file defines the core data structures and types for representing profiling information, such as samples, mappings, functions, and locations, within the `libdatadog` profiling API. It also includes types for managing string IDs and handling profiling data upscaling.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/collections/mod.rs",
            "description": "This file serves as the module declaration for various collection-related utilities within the `libdd-profiling` library, exporting submodules like `identifiable`, `string_storage`, and `string_table`.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/collections/string_storage.rs",
            "description": "This file implements `ManagedStringStorage`, a thread-safe, deduplicated, and reference-counted storage system for strings, optimized for managing string IDs across multiple profiling contexts with caching and usage-based retention.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/collections/identifiable/string_id.rs",
            "description": "This file defines `StringId` as an identifier for strings, aliasing it to `StringOffset`. It implements the `Id` trait, providing conversion methods between `usize` offsets and `StringId`, and allowing retrieval of a raw `i64` identifier.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/collections/identifiable/mod.rs",
            "description": "This module defines traits and utilities for creating and managing unique identifiers (IDs) for items within collections, focusing on efficient deduplication and generation of pprof-compatible IDs.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/profiles/mod.rs",
            "description": "This file serves as the main module for profiling-related components, organizing and exposing sub-modules like data structures, compression utilities, and profile-specific data types for the `libdd-profiling` library.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/datatypes/function.rs",
            "description": "This file defines data structures (`Function`, `Function2`, `FunctionId2`) for representing functions in a profiling context, focusing on internal representation and FFI-safe versions to handle nullability and references within a profiling dictionary.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/datatypes/mod.rs",
            "description": "This file serves as the module root for profile-related datatypes, aggregating and re-exporting various data structure definitions used within the profiling component.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/datatypes/value_type.rs",
            "description": "This file defines the `ValueType` struct, which encapsulates a data type and its associated unit using string references for identification in profiling data.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/datatypes/mapping.rs",
            "description": "Defines data structures (`Mapping`, `Mapping2`) for representing memory mappings in profiling, with `Mapping2` serving as an FFI-safe version that allows null values for string references, ensuring layout compatibility between the internal and FFI representations.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/datatypes/profiles_dictionary.rs",
            "description": "This file defines a thread-safe, deduplicating dictionary (`ProfilesDictionary`) for storing and managing common profiling data elements (functions, mappings, and strings) across multiple profiles.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/slice_set.rs",
            "description": "Defines a `SliceSet` data structure for efficiently storing and managing a collection of unique slices. It uses a hash table and a custom allocator to intern slices, providing handles to prevent duplication and optimize memory.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/string_set.rs",
            "description": "Implements an unsynchronized set (`UnsyncStringSet`) for efficiently storing unique UTF-8 strings and retrieving them via compact `StringRef` handles. It includes support for a set of pre-defined \"well-known\" strings.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/parallel/string_set.rs",
            "description": "Defines a `ParallelStringSet` for efficient, thread-safe storage and retrieval of unique strings. It acts as a concurrent set, allowing parallel read and write operations, and includes support for 'well-known' strings and FFI interoperability.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/parallel/set.rs",
            "description": "Defines a `ParallelSet` data structure, which is a thread-safe, sharded set designed for concurrent storage and retrieval of unique elements.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/parallel/mod.rs",
            "description": "This file serves as the module entry point for parallel collections, aggregating and re-exporting sub-modules related to parallel sets and sharded data structures.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/parallel/slice_set.rs",
            "description": "This file defines `ParallelSliceSet`, a sharded, thread-safe collection optimized for storing and retrieving immutable slices of data efficiently, supporting concurrent read and write operations without item removal.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/parallel/sharded.rs",
            "description": "This file defines a generic sharded concurrent set data structure in Rust, allowing an underlying `SetOps` implementation to be distributed across multiple read-write locked shards for improved parallelism. It provides methods for creating the sharded set and safely inserting elements.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/mod.rs",
            "description": "This module acts as an aggregation point, re-exporting various custom collection types and utilities (e.g., sets, string sets, parallel structures, thin strings) that are specialized for handling profiling data within `libdatadog`. It also defines a custom hasher for these collections.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/set.rs",
            "description": "This file implements `Set<T>`, a custom, arena-backed hash set data structure for Rust. It provides methods for inserting, finding, and managing the lifecycle of elements stored within its internal memory allocator.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/thin_str.rs",
            "description": "This file defines `ThinStr` and `ThinSlice` types, which are compact, non-owning string and slice references designed for efficient inline storage by storing length metadata directly before the data.",
            "spof": true
          },
          {
            "path": "libdd-profiling/benches/main.rs",
            "description": "This file serves as the main entry point for running Criterion benchmarks for the `libdd-profiling` library, orchestrating benchmarks from modules like `add_samples` and `interning_strings`.",
            "spof": true
          },
          {
            "path": "libdd-profiling/benches/add_samples.rs",
            "description": "This file contains benchmarks comparing the performance of adding samples to a profile using two different API versions (v1 and v2) within the `libdd-profiling` library.",
            "spof": true
          },
          {
            "path": "libdd-profiling/benches/interning_strings.rs",
            "description": "This file contains benchmarks for string interning functionality within `libdd-profiling`. It measures the performance of the `StringTable`'s `intern` method using a dataset of WordPress strings.",
            "spof": false
          },
          {
            "path": "datadog-profiling-replayer/src/profile_index.rs",
            "description": "This file defines a `ProfileIndex` struct that provides efficient indexed access to elements (mappings, locations, functions, and strings) within a `pprof::Profile` object using their IDs.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Levi Morrison",
            "percent": 82
          },
          {
            "name": "Daniel Schwartz-Narbonne",
            "percent": 14
          },
          {
            "name": "Florian Engelhardt",
            "percent": 3
          }
        ]
      },
      "Asynchronous Profile Exporting": {
        "files": [
          {
            "path": "examples/EXPORTER_MANAGER.md",
            "description": "This markdown file provides examples and documentation for using the `ExporterManager` in `libdatadog`, detailing its features for asynchronous and fork-safe profile exporting in C FFI and C++ CXX.",
            "spof": true
          },
          {
            "path": "examples/ffi/exporter_manager.c",
            "description": "This example demonstrates how to use the `ExporterManager` API with support for process forking, queueing profiling data to be sent asynchronously by a background thread, and handling `ddog_Error` messages.",
            "spof": true
          },
          {
            "path": "examples/cxx/exporter_manager.cpp",
            "description": "This file provides C++ examples demonstrating the asynchronous management and export of profiling data using `libdatadog-profiling`'s `ExporterManager`, including a basic usage scenario and a more advanced, fork-safe implementation.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/exporter/mod.rs",
            "description": "This module serves as the entry point for the profiling exporter component, orchestrating and re-exporting its various sub-modules like configuration, error handling, and the exporter manager.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/exporter/profile_exporter.rs",
            "description": "Implements a `reqwest`-based profiling data exporter, supporting both asynchronous and synchronous sending of profiles, and offering features like debugging with HTTP request file dumps.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/exporter/errors.rs",
            "description": "This file defines custom error types used within the exporter component, including common issues like invalid URLs, timeouts, and user cancellations, as well as specific errors encountered during the process of sending data.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/exporter/config.rs",
            "description": "This file defines functions for creating and configuring `Endpoint` objects, which specify how to export profiling data to the Datadog agent (via HTTP, UDS, or named pipes), directly to Datadog intake, or to a local file for debugging.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/exporter/exporter_manager.rs",
            "description": "This file defines the `ExporterManager`, which orchestrates the asynchronous export of profiling data. It manages the exporter's state, including a dedicated worker thread for sending profiles, and handles process lifecycle events like forking.",
            "spof": true
          },
          {
            "path": "libdd-profiling/tests/file_exporter_test.rs",
            "description": "Contains unit tests for the file-based profile exporter, verifying that profiles are correctly formatted and written to temporary files as HTTP multipart requests.",
            "spof": true
          },
          {
            "path": "libdd-profiling/tests/exporter_e2e.rs",
            "description": "End-to-end tests for the `ProfileExporter` component, validating the complete profile export flow across various endpoint types.",
            "spof": true
          },
          {
            "path": "libdd-profiling/tests/common.rs",
            "description": "This file contains common test utilities for `libdd-profiling`, specifically a function to assert that Datadog entity headers (container-id, entity-id, external-env) match expected values from `libdd_common::entity_id`.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Daniel Schwartz-Narbonne",
            "percent": 99
          },
          {
            "name": "Levi Morrison",
            "percent": 1
          },
          {
            "name": "Gregory LEOCADIE",
            "percent": 0
          }
        ]
      },
      "Multi-Language Bindings": {
        "files": [
          {
            "path": "examples/ffi/profiles.c",
            "description": "This C file demonstrates how to use the Datadog profiling Foreign Function Interface (FFI) by showcasing both an older and a newer API for adding profile samples. It highlights the improved efficiency of the newer API through the use of a `ProfilesDictionary` for managing strings and metadata IDs.",
            "spof": true
          },
          {
            "path": "examples/ffi/exporter.cpp",
            "description": "This file demonstrates how to use the Datadog profiling C/C++ FFI to create a profile, add samples and rules, serialize it, and then export it to Datadog, including an example of asynchronous cancellation during the export process.",
            "spof": true
          },
          {
            "path": "examples/ffi/profile_intern.cpp",
            "description": "This C++ example demonstrates how to use the Datadog profiling C FFI to create and populate a profile, focusing on interning various profile components and adding a large number of samples.",
            "spof": true
          },
          {
            "path": "examples/cxx/README.md",
            "description": "This README provides an overview and instructions for C++ examples demonstrating the CXX bindings for libdatadog components, including crash reporting and profiling features.",
            "spof": true
          },
          {
            "path": "examples/cxx/profiling.cpp",
            "description": "This file is a C++ example demonstrating the usage of Datadog's profiling bindings. It showcases how to create a profile, add samples, configure upscaling rules and endpoint mappings, and export the profile using different exporter types (agentless, agent, or file).",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/README.md",
            "description": "This README provides an overview of `libdd-profiling-ffi`, detailing its purpose as C FFI bindings for `libdd-profiling`. It explains how to integrate Datadog profiling into applications written in various languages, covering features, build artifacts, and usage examples.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/src/profile_error.rs",
            "description": "This file defines the `ProfileError` enum, which represents various errors that can occur within the profiling FFI, providing a Rust-friendly error handling mechanism with conversions from other error types.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/src/profile_status.rs",
            "description": "Defines the `ProfileStatus` struct, an FFI-stable type used to represent the result of an operation (success or error with a message) for interoperability with C.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/src/lib.rs",
            "description": "This file serves as the main entry point for the `libdd-profiling-ffi` Rust library. It orchestrates the inclusion and re-export of various Datadog-related FFI modules, providing a unified interface for profiling and other Datadog functionalities.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/src/arc_handle.rs",
            "description": "This file defines `ArcHandle<T>`, an opaque FFI-safe handle for `Arc<T>`'s inner value, enabling safe reference-counted resource management and sharing across FFI boundaries.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/src/string_storage.rs",
            "description": "Provides a C-compatible FFI (Foreign Function Interface) for a managed string storage system, allowing C-code to intern, unintern, and retrieve strings efficiently by ID.",
            "spof": false
          },
          {
            "path": "libdd-profiling-ffi/src/exporter.rs",
            "description": "This file provides the Foreign Function Interface (FFI) for creating, managing, and sending profiling data to various Datadog endpoints or local files. It exposes Rust's profiling exporter functionality to C-compatible languages.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/src/profiles/interning_api.rs",
            "description": "This file provides the Foreign Function Interface (FFI) for interning various profiling data types (like functions, labels, locations, and strings) into a `libdatadog` profile object. It defines C-compatible functions for managing and referencing these interned profiling elements.",
            "spof": false
          },
          {
            "path": "libdd-profiling-ffi/src/profiles/mod.rs",
            "description": "This module (`mod.rs`) acts as the entry point for the `profiles` sub-crate within `libdd-profiling-ffi`. It defines and re-exports utility macros for ensuring null-pointer safety in FFI calls and organizes sub-modules related to profile data types, interning, and dictionary management.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/src/profiles/datatypes.rs",
            "description": "This file defines the C-compatible data structures (datatypes) used for representing profiling information within the `libdatadog` FFI layer, and provides conversions to the internal `libdd_profiling` API types. It serves as the interface for exchanging profiling data with C.",
            "spof": false
          },
          {
            "path": "libdd-profiling-ffi/src/profiles/utf8.rs",
            "description": "This file provides utilities for robust and fallible conversion of byte slices to UTF-8 strings, offering different strategies like assuming validity, validation, or lossy conversion. It handles potential errors like out-of-memory or invalid UTF-8, primarily for FFI string handling within a profiling context.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/src/profiles/profiles_dictionary.rs",
            "description": "This file implements the Foreign Function Interface (FFI) for managing a `ProfilesDictionary`, which stores and deduplicates common profiling data such as strings, functions, and mappings, accessible from C-compatible languages.",
            "spof": true
          },
          {
            "path": "libdd-profiling/CHANGELOG.md",
            "description": "This file tracks all notable changes and version history for the `libdd-profiling` library. It lists new features, bug fixes, and other updates for each release.",
            "spof": false
          },
          {
            "path": "libdd-profiling/src/cxx.rs",
            "description": "This file provides CXX bindings for the profiling module, enabling a safe and idiomatic C++ API to interact with Rust's profiling functionalities. It defines data structures and functions for creating, managing, and exporting profiles.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/datatypes/string.rs",
            "description": "This file defines FFI-safe string identifiers (`StringId2`) for the `libdatadog` profiling library. It handles their representation and conversions with `StringRef`, prioritizing ABI and type safety for foreign function interfaces.",
            "spof": true
          },
          {
            "path": "libdd-profiling/src/profiles/collections/error.rs",
            "description": "This file defines the `SetError` enum, a custom error type for operations related to collections, providing FFI-safe error messages and conversions from various allocation errors.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Daniel Schwartz-Narbonne",
            "percent": 62
          },
          {
            "name": "Levi Morrison",
            "percent": 35
          },
          {
            "name": "Julio Gonzalez",
            "percent": 1
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 101,
      "spofCount": 61
    },
    "busFactor": 1,
    "authorCount": 8
  },
  "Utility": {
    "description": "",
    "functions": {
      "General Utility": {
        "files": [
          {
            "path": "libdd-common/src/config.rs",
            "description": "This file provides utility functions for safely parsing environment variables into various data types such as durations, integers, booleans, non-empty strings, and URIs, primarily for configuration purposes.",
            "spof": false
          },
          {
            "path": "libdd-trace-normalization/src/utf8_helpers.rs",
            "description": "This file provides utility functions for UTF-8 string manipulation, including finding character boundaries and decoding individual code points, potentially replicating standard library functionality.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/util.rs",
            "description": "This file provides utility traits for `SystemTime` to calculate time until a deadline and for `HashMap` to compact its capacity based on a usage ratio.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/examples/compression.rs",
            "description": "This file provides an example of how to add custom message compression (using Deflate) to `tarpc` services by wrapping the underlying transport. It includes helper functions for compressing/decompressing messages and demonstrates their integration into a `tarpc` server and client.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/src/send_with_retry/retry_strategy.rs",
            "description": "Defines the `RetryBackoffType` enum and `RetryStrategy` struct, which specify different backoff methods (constant, linear, exponential) and parameters (max retries, delay, jitter) for managing retry logic in data transmission.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/src/send_with_retry/mod.rs",
            "description": "Provides a utility function to send HTTP requests to an endpoint with automatic retries in case of failure (e.g., network errors, timeouts, or specific HTTP status codes).",
            "spof": false
          },
          {
            "path": "tools/src/lib.rs",
            "description": "This file provides utility functions for processing and de-duplicating C header file definitions (typedefs and #defines), and includes a module for handling JUnit file attributes.",
            "spof": true
          },
          {
            "path": "tools/src/junit_file_attributes.rs",
            "description": "This module enriches JUnit XML test reports by adding 'file' attributes to testcase elements, mapping Rust test paths to their source files using Cargo metadata.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Edmund Kump",
            "percent": 68
          },
          {
            "name": "paullegranddc",
            "percent": 26
          },
          {
            "name": "Julio Gonzalez",
            "percent": 4
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 8,
      "spofCount": 3
    },
    "busFactor": 4,
    "authorCount": 5
  },
  "Infrastructure": {
    "description": "",
    "functions": {
      "Build & Configuration": {
        "files": [
          {
            "path": "libdd-common/src/cc_utils.rs",
            "description": "This file provides an 'ImprovedBuild' struct that wraps the `cc::Build` functionality, simplifying the compilation of C/C++ source files into executables or shared libraries, and managing linker arguments.",
            "spof": true
          },
          {
            "path": "libdd-trace-normalization/fuzz/README.md",
            "description": "This README file provides instructions for fuzz testing the `libdd-trace-normalization` library using `cargo-fuzz`, including how to run the fuzzer, reproduce findings, and generate coverage.",
            "spof": true
          },
          {
            "path": "libdd-trace-utils/tests/snapshots",
            "description": "This directory is intended to store snapshot files for tests within the `libdd-trace-utils` component. Snapshot tests compare current output to these pre-recorded files, helping to detect unintended changes or regressions. Although currently empty, it serves as the designated location for such test data.",
            "spof": false
          },
          {
            "path": "ruby/gems.rb",
            "description": "This file specifies the gem dependencies and their versions for the Ruby project, including development and testing tools. It uses `gemspec` to include core dependencies and lists additional gems like `rake`, `rspec`, `standard`, and `pry`.",
            "spof": true
          },
          {
            "path": "ruby/publish/rakefile.rb",
            "description": "This Rakefile enables the Ruby `rake` command to be executed from the repository root, which is essential for the `publish-ruby.yml` CI workflow to function correctly.",
            "spof": false
          },
          {
            "path": "ruby/spec/spec_helper.rb",
            "description": "This file configures the RSpec testing framework for the `libdatadog` project, setting up various behaviors for tests, expectations, and mocking.",
            "spof": true
          },
          {
            "path": "libdd-profiling-ffi/.cargo",
            "description": "This directory is reserved for local Cargo configuration specific to the `libdd-profiling-ffi` Rust project. Although currently empty, it can house files like `config.toml` to customize build settings, target-specific configurations, or registry settings for this FFI library. Its purpose is to provide a dedicated scope for managing Cargo's behavior within this Rust component.",
            "spof": false
          },
          {
            "path": ".config/commitlint.config.js",
            "description": "This file configures commitlint to enforce specific rules for commit messages in the repository. It includes a custom rule to ensure ticket IDs, if present, are at the end of the subject line, and disables the default subject case rule.",
            "spof": true
          },
          {
            "path": ".devcontainer/ubuntu",
            "description": "This directory is intended to house Ubuntu-specific configuration files for the DevContainer development environment. As it is currently empty, it implies that no specific Ubuntu customizations are presently required, and default or parent-level DevContainer settings are being used.",
            "spof": false
          },
          {
            "path": ".devcontainer/alpine-x86_64",
            "description": "This directory serves as a placeholder or configuration context for a development container setup tailored for Alpine Linux on an x86_64 architecture within the `libdatadog` project. It would typically house `devcontainer.json` or Dockerfile configurations for this specific environment. Its current emptiness suggests either a planned but not yet implemented setup, or that the configuration is handled by a parent `.devcontainer` directory.",
            "spof": false
          },
          {
            "path": ".devcontainer/alpine",
            "description": "This directory is intended to house configuration files for an Alpine Linux-based development container for the `libdatadog` project. Although currently empty, its existence within `.devcontainer` indicates Alpine is a supported or intended environment option.",
            "spof": false
          },
          {
            "path": "fuzz/fuzz_infra.py",
            "description": "This script automates the discovery, building, and uploading of Rust fuzz targets to an internal fuzzing infrastructure. It's designed to be used within a CI/CD pipeline, specifically called from GitLab CI, to integrate fuzzing into the development workflow.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/config.rs",
            "description": "This file defines the configuration structure for the Datadog sidecar, including IPC mode, logging, telemetry, and AppSec settings. It provides mechanisms to load these configurations from environment variables and serialize them back.",
            "spof": false
          },
          {
            "path": "tests/windows_package",
            "description": "This directory is designated for tests related to the `libdatadog` library's packaging on Windows. It serves as a placeholder for validating Windows-specific distribution and installation processes.",
            "spof": false
          },
          {
            "path": "tools/docker",
            "description": "This directory is intended to house Docker-related tools, scripts, or configurations for the `libdatadog` project. Although currently empty, its purpose within the `tools` sub-repository is to support Docker-based development, testing, or deployment workflows for `libdatadog`.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Edouard Schweisguth",
            "percent": 66
          },
          {
            "name": "Igor Unanua",
            "percent": 11
          },
          {
            "name": "Ivo Anjo",
            "percent": 9
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 15,
      "spofCount": 6
    },
    "busFactor": 2,
    "authorCount": 5
  },
  "Sidecar & Service Management": {
    "description": "Provides a resilient, out-of-process architecture that manages all data collection and communication, ensuring minimal performance impact on the host application and enhancing stability.",
    "functions": {
      "Inter-Process Communication (IPC) Abstraction": {
        "files": [
          {
            "path": "libdd-common/src/connector/named_pipe.rs",
            "description": "This file provides utility functions to convert Windows named pipe paths to and from `hyper::Uri` objects, enabling their use in a URI scheme.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/lib.rs",
            "description": "This file is the main library entry point for the `datadog-ipc` crate, providing core functionalities for inter-process communication (IPC). It organizes modules related to transport, handles, platform-specific implementations, and rate limiting, leveraging `tarpc` for RPC.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/platform/unix/channel/async_channel.rs",
            "description": "This file defines an asynchronous communication channel based on Unix domain sockets, capable of sending and receiving both data and file descriptors using `tokio`.",
            "spof": false
          },
          {
            "path": "datadog-ipc/src/transport/blocking.rs",
            "description": "This file defines a `BlockingTransport` for inter-process communication (IPC) in Rust, providing blocking I/O operations for sending and receiving length-delimited `tarpc` messages over a channel, including serialization and deserialization of items that can transfer handles.",
            "spof": true
          },
          {
            "path": "datadog-ipc/benches/ipc.rs",
            "description": "This file contains benchmarks for measuring the performance of inter-process communication (IPC) mechanisms within the `datadog-ipc` library, specifically for `send` and `call` operations using Unix sockets.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/one_way_shared_memory.rs",
            "description": "This file implements a one-way shared memory communication mechanism in Rust, providing `OneWayShmWriter` and `OneWayShmReader` for concurrent and synchronized data exchange using shared memory handles and a generation-based update protocol.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/service/blocking.rs",
            "description": "Provides a blocking communication transport (`SidecarTransport`) for the Datadog sidecar service, including transparent reconnection logic and utilities for sending various sidecar-related requests (e.g., traces, debugger data, session management).",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/setup/mod.rs",
            "description": "This file defines the `Liaison` trait, which provides an abstraction for establishing and managing inter-process communication (IPC) connections to a Datadog sidecar server, with platform-specific implementations for Unix and Windows.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/setup/unix.rs",
            "description": "This file defines Unix-specific mechanisms for Inter-Process Communication (IPC) within the Datadog sidecar, implementing the `Liaison` trait using both file-based Unix domain sockets and Linux-specific abstract Unix sockets to enable communication between the sidecar and its clients.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/setup/windows.rs",
            "description": "This file provides the Windows-specific implementation for inter-process communication (IPC) using named pipes for the Datadog sidecar. It defines how the sidecar connects to clients, listens for incoming connections, and manages shared memory for process identification on Windows systems.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 79
          },
          {
            "name": "Alexandre Rulleau",
            "percent": 13
          },
          {
            "name": "Igor Unanua",
            "percent": 4
          }
        ]
      },
      "Resource Management & Throttling": {
        "files": [
          {
            "path": "datadog-ipc/tests/flock.rs",
            "description": "This file contains unit tests for the `FLock` (file lock) mechanism, verifying its behavior across multiple processes and its proper lifecycle management, including lock acquisition, blocking, and removal upon release.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/server/limits.rs",
            "description": "This file aggregates different limiting mechanisms for the `tarpc` server, including modules for limiting active channels per key and in-flight requests per channel.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/server/incoming.rs",
            "description": "This file defines an `Incoming` trait that extends streams of channels, providing methods for rate-limiting (e.g., max channels per key, max requests per channel) and concurrently executing incoming requests, particularly within a Tokio-based server.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/server/limits/requests_per_channel.rs",
            "description": "This file defines structures for throttling requests on RPC channels. It provides a `MaxRequests` wrapper to limit concurrent in-flight requests on a single channel and `MaxRequestsPerChannel` to apply this limit to a stream of channels.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/src/server/limits/channels_per_key.rs",
            "description": "This file defines a mechanism to limit the number of active communication channels per key in a server, dropping new connections if the configured limit for a specific key is reached. It tracks channel lifecycle and updates counts accordingly when channels are closed.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/exception_hash_rate_limiter.rs",
            "description": "This file implements a shared memory-based rate limiter for exception hashes, featuring a managed service that periodically cleans up inactive limiters to efficiently manage shared resources.",
            "spof": true
          },
          {
            "path": "spawn_worker/src/unix/spawn.rs",
            "description": "This file implements a robust and configurable mechanism for spawning child processes (workers) on Unix-like systems, supporting various execution methods like `fexecve` via memory files, `LD_PRELOAD`, or direct `exec`, and managing their environment and standard I/O.",
            "spof": false
          },
          {
            "path": "tests/spawn_from_lib/tests/spawn.rs",
            "description": "This file contains integration tests for the `spawn_from_lib` functionality, verifying that worker processes can be correctly spawned and their standard output/error streams captured, particularly when the 'prefer-dynamic' feature is enabled.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 46
          },
          {
            "name": "Edmund Kump",
            "percent": 20
          },
          {
            "name": "Levi Morrison",
            "percent": 16
          }
        ]
      },
      "RPC Framework & Service Definition": {
        "files": [
          {
            "path": "datadog-ipc/tarpc/src/server/tokio.rs",
            "description": "This file implements Tokio-specific executors for the `tarpc` server, allowing it to concurrently handle incoming client channels and individual requests by spawning tasks on the Tokio runtime.",
            "spof": false
          },
          {
            "path": "datadog-ipc/tarpc/tests/dataservice.rs",
            "description": "This file defines and tests a `tarpc` (RPC) service called `ColorProtocol`. It includes the service definition, an implementation (`ColorServer`), and a unit test that sets up a server and client to verify the RPC call for getting the opposite color.",
            "spof": false
          },
          {
            "path": "datadog-ipc/plugins/tests/server.rs",
            "description": "This file contains unit tests for the `tarpc` procedural macros, specifically verifying the correct generation of service trait and server implementation code, including handling of future types, raw identifiers, and various method signatures.",
            "spof": false
          },
          {
            "path": "datadog-ipc/plugins/tests/service.rs",
            "description": "This file contains unit tests for the `tarpc::service` macro, verifying its functionality with standard Rust traits, raw identifiers, and various asynchronous function signatures within a service definition.",
            "spof": false
          },
          {
            "path": "datadog-ipc/plugins/src/lib.rs",
            "description": "This file defines a procedural macro that generates boilerplate code for RPC services. It parses a service definition and generates associated traits, client stubs, and data structures for inter-process communication.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/tests/test_fetch_info.rs",
            "description": "This file contains integration tests for fetching agent information from a simulated Datadog agent. It verifies the functionality of `fetch_info` and `AgentInfoFetcher`.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/request_identification.rs",
            "description": "This file defines the `RequestIdentification` trait and the `RequestIdentifier` enum, standardizing how requests are identified within the datadog-sidecar service. It provides mechanisms to extract and represent request identifiers like instance IDs or session IDs.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/sidecar_interface.rs",
            "description": "This file defines the `SidecarInterface` trait, which specifies the asynchronous RPC methods for interacting with a Datadog sidecar service. It outlines operations for enqueuing actions, managing sessions, sending traces, debugger data, DogStatsD metrics, and other service-related commands.",
            "spof": false
          },
          {
            "path": "datadog-sidecar-macros/src/lib.rs",
            "description": "This file implements Rust procedural macros. It includes an attribute macro to generate request identification logic for `tarpc` services and a function macro to read environment variables at compile time with a default fallback.",
            "spof": false
          },
          {
            "path": "datadog-ipc-macros/src/lib.rs",
            "description": "This Rust procedural macro defines an attribute `impl_transfer_handles` that automatically generates implementations for `TransferHandles` trait for request and response enums derived from an input trait. It facilitates the transfer of system handles (like file descriptors) over IPC by generating logic based on `#[SerializedHandle]` attributes on trait method arguments or return types.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Bob Weinand",
            "percent": 60
          },
          {
            "name": "Alexandre Rulleau",
            "percent": 32
          },
          {
            "name": "Igor Unanua",
            "percent": 8
          }
        ]
      },
      "Telemetry & Trace Data Pipeline": {
        "files": [
          {
            "path": "libdd-telemetry/examples/tm-worker-test.rs",
            "description": "This file is an example demonstrating the usage of `libdd-telemetry`'s `TelemetryWorker` to send various telemetry data, including metrics and logs, to a local file endpoint for testing purposes.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/src/worker/http_client.rs",
            "description": "This file defines an HTTP client trait and its implementations for sending Datadog telemetry, including a standard Hyper-based client and a mock client that writes requests to a file for testing purposes.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/src/worker/scheduler.rs",
            "description": "This file defines a `Scheduler` struct responsible for managing and scheduling events based on predefined delays. It allows events to be scheduled at a future instant and provides functionality to retrieve the next upcoming deadline.",
            "spof": false
          },
          {
            "path": "libdd-telemetry/src/worker/store.rs",
            "description": "This file defines a bounded, deduplicating data store for telemetry items, which tracks both all stored items and a subset of items waiting to be flushed.",
            "spof": false
          },
          {
            "path": "libdd-telemetry/src/worker/mod.rs",
            "description": "This module defines the TelemetryWorker, which is responsible for collecting, storing, and processing various telemetry data (metrics, logs, dependencies, configurations) for the Datadog library. It manages the lifecycle of telemetry actions and dispatches them for further handling.",
            "spof": false
          },
          {
            "path": "libdd-trace-utils/tests/test_send_data.rs",
            "description": "This file contains integration tests for the `send_data` module, verifying its functionality to correctly format and send trace data to a Datadog agent using various configurations and transport methods, including snapshot comparisons.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/src/trace_exporter/transport.rs",
            "description": "This file defines a `TransportClient` responsible for building and populating HTTP requests for sending trace data to a Datadog agent. It handles adding metadata, trace-specific headers, and the request body.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/service/runtime_metadata.rs",
            "description": "This file defines the `RuntimeMetadata` struct, used to store information about the language and tracer versions of an application. It provides methods to create and manage this runtime-specific data.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/tracing/trace_send_data.rs",
            "description": "This file defines the `TraceSendData` struct, which manages a buffer of trace data along with its size. It provides methods to initiate a flush operation for this data, either asynchronously or by returning a future that can be awaited.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Jules Wiriath",
            "percent": 78
          },
          {
            "name": "Alejandro Estringana Ruiz",
            "percent": 10
          },
          {
            "name": "Igor Unanua",
            "percent": 5
          }
        ]
      },
      "C-Language Interoperability (FFI)": {
        "files": [
          {
            "path": "libdd-telemetry-ffi/src/lib.rs",
            "description": "This Rust library defines the C Foreign Function Interface (FFI) for Datadog telemetry, including macros to generate C-compatible setter functions for telemetry configuration and properties.",
            "spof": true
          },
          {
            "path": "libdd-telemetry-ffi/src/worker_handle.rs",
            "description": "This file defines the C Foreign Function Interface (FFI) for interacting with the Datadog telemetry worker. It exposes functions for managing the worker's lifecycle and sending telemetry data, including dependencies, integrations, logs, and metrics.",
            "spof": true
          },
          {
            "path": "datadog-sidecar-ffi/tests/span.rs",
            "description": "This file contains unit tests for the Foreign Function Interface (FFI) bindings of the Datadog span management library, verifying the creation, manipulation, and retrieval of span data, metadata, metrics, links, and events.",
            "spof": true
          },
          {
            "path": "datadog-sidecar-ffi/tests/sidecar.rs",
            "description": "This file contains integration tests for the `datadog-sidecar-ffi` crate, verifying its FFI bindings for connecting to the Datadog sidecar, handling file descriptors, and registering application and telemetry information.",
            "spof": false
          },
          {
            "path": "datadog-sidecar-ffi/src/lib.rs",
            "description": "This file provides a Foreign Function Interface (FFI) for the Datadog sidecar, exposing its functionalities (like crash tracking, shared memory management, remote configuration, and sidecar communication) to C/C++ and other languages.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Gustavo Lopes",
            "percent": 42
          },
          {
            "name": "Alexandre Rulleau",
            "percent": 38
          },
          {
            "name": "Igor Unanua",
            "percent": 7
          }
        ]
      },
      "Sidecar Core & Lifecycle Management": {
        "files": [
          {
            "path": "datadog-sidecar/src/self_telemetry.rs",
            "description": "This file implements the self-telemetry mechanism for the Datadog sidecar, collecting and sending internal metrics about its operation, such as server activity, memory usage, and trace API interactions, to a telemetry worker.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/entry.rs",
            "description": "This file serves as the main entry point for the Datadog sidecar daemon, orchestrating its setup, lifecycle management, client connections, and integration with telemetry and crash tracking services. It handles daemonization, IPC listener setup, and manages the sidecar's main event loop.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/watchdog.rs",
            "description": "This file implements a watchdog mechanism for the `datadog-sidecar` service, monitoring its liveness and memory usage. It triggers an abort or exit if the service becomes unresponsive or exceeds its memory limit, and allows for graceful shutdown.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/lib.rs",
            "description": "This file serves as the main library for the Datadog sidecar, organizing modules related to configuration, tracing, crash tracking, and service operation for the sidecar process.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/windows.rs",
            "description": "This file contains Windows-specific implementation for the Datadog sidecar daemon, handling its entry point, inter-process communication (IPC) via named pipes, crash tracking setup, and generating unique identifiers for sidecar processes based on Windows security information.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/unix.rs",
            "description": "This file implements the Unix-specific entry point and core logic for the Datadog sidecar daemon, handling inter-process communication, managing an AppSec helper, and integrating a crash tracker.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/service/queue_id.rs",
            "description": "This file defines the `QueueId` struct, which serves as a unique identifier for queues, and provides functionality to generate new unique IDs using a random 64-bit unsigned integer.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/service/runtime_info.rs",
            "description": "This file defines data structures and logic for managing runtime and active application information within the Datadog sidecar service, including metadata, debugger tags, and remote configuration updates.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/session_info.rs",
            "description": "This file defines the `SessionInfo` struct, which manages session-specific configurations and runtime information for the Datadog sidecar, including handling telemetry, tracing, debugging, and dogstatsd settings, as well as managing the lifecycle of associated runtimes.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/sidecar_server.rs",
            "description": "This file implements the `SidecarServer` which serves as the core component of the Datadog sidecar, handling client connections, managing sessions, and orchestrating services like trace flushing, telemetry, and remote configuration.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/instance_id.rs",
            "description": "Defines the `InstanceId` struct, which encapsulates session and runtime identifiers used for tracking a specific instance of a service, along with its constructor.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/service/mod.rs",
            "description": "This file serves as the main module for the Datadog sidecar's service component, defining its overall structure, session configuration, and the various actions it can perform. It orchestrates and re-exports sub-modules related to the sidecar's operational logic.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/fixtures",
            "description": "This directory is designated to store test fixtures or sample data specifically for the `datadog-sidecar` component. Although currently empty, its primary role is to provide pre-defined data sets for testing and validation processes.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Alexandre Rulleau",
            "percent": 41
          },
          {
            "name": "Bob Weinand",
            "percent": 34
          },
          {
            "name": "Gustavo Lopes",
            "percent": 9
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 55,
      "spofCount": 17
    },
    "busFactor": 3,
    "authorCount": 9
  },
  "Custom Metrics & Monitoring": {
    "description": "Enables applications to send custom business or operational metrics to Datadog, providing accurate, real-time quantile estimation for high-volume data streams used in dashboards and alerts.",
    "functions": {
      "DogStatsD Metric Submission": {
        "files": [
          {
            "path": "libdd-dogstatsd-client/README.md",
            "description": "This README describes `libdd-dogstatsd-client`, a Rust client library for sending metrics to Datadog via the DogStatsD protocol.",
            "spof": true
          },
          {
            "path": "libdd-dogstatsd-client/CHANGELOG.md",
            "description": "This file documents the version history and changes made to the libdd-dogstatsd-client library. It serves as a record of all releases, starting with the initial 1.0.0 version.",
            "spof": true
          },
          {
            "path": "libdd-dogstatsd-client/src/lib.rs",
            "description": "This file implements a client to emit metrics to a DogStatsD server, defining enums for various metric types and a client for sending them via UDP or Unix sockets.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Igor Unanua",
            "percent": 61
          },
          {
            "name": "Levi Morrison",
            "percent": 22
          },
          {
            "name": "Julio Gonzalez",
            "percent": 17
          }
        ]
      },
      "DDSketch Quantile Estimation": {
        "files": [
          {
            "path": "examples/ffi/ddsketch.c",
            "description": "This file is an example demonstrating the usage of the `libdatadog` FFI for DDSketch. It creates a DDSketch, adds sample data, retrieves statistics, and encodes the sketch to a protobuf format.",
            "spof": true
          },
          {
            "path": "libdd-ddsketch-ffi/README.md",
            "description": "This README describes `libdd-ddsketch-ffi`, which provides C FFI bindings for the `libdd-ddsketch` crate. It enables C/C++ applications to use DDSketch for accurate quantile estimation.",
            "spof": true
          },
          {
            "path": "libdd-ddsketch-ffi/src/lib.rs",
            "description": "This file provides a C-compatible Foreign Function Interface (FFI) for the `libdd-ddsketch` library, enabling other languages to create, manipulate, and serialize DDSketch data structures.",
            "spof": true
          },
          {
            "path": "libdd-ddsketch/CHANGELOG.md",
            "description": "This file serves as the changelog for the `libdd-ddsketch` library, documenting all releases, new features, and bug fixes over time.",
            "spof": false
          },
          {
            "path": "libdd-ddsketch/README.md",
            "description": "This README file describes libdd-ddsketch, a minimal implementation of Datadog's DDSketch for accurate quantile estimation. It outlines its features, including data insertion, count queries, and Protobuf serialization.",
            "spof": true
          },
          {
            "path": "libdd-ddsketch/src/lib.rs",
            "description": "This crate defines a minimal implementation of DDSketch, a data structure used to generate percentiles over streaming data with constant memory.",
            "spof": false
          },
          {
            "path": "libdd-ddsketch/src/pb.rs",
            "description": "This file contains `prost-build` generated Rust data structures for the DDSketch Protocol Buffer definition, defining the structure of a DDSketch, its index mapping, and its data storage.",
            "spof": false
          },
          {
            "path": "libdd-ddsketch/src/pb",
            "description": "This directory is designated for Protocol Buffer definitions or generated code specific to the `libdd-ddsketch` component. It serves as a placeholder for data serialization schemas within this library. Its current emptiness indicates no such definitions are presently stored here.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Julio Gonzalez",
            "percent": 46
          },
          {
            "name": "Edmund Kump",
            "percent": 44
          },
          {
            "name": "George Hahn",
            "percent": 6
          }
        ]
      },
      "Internal Telemetry Pipeline": {
        "files": [
          {
            "path": "examples/ffi/telemetry.c",
            "description": "This file is an FFI example program demonstrating how to initialize, configure, start, and stop the Datadog telemetry worker in C.",
            "spof": true
          },
          {
            "path": "examples/ffi/telemetry_metrics.c",
            "description": "This C example demonstrates how to use the Datadog FFI to send telemetry metrics and logs through `libdatadog`, writing the output to a local file.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/examples/tm-metrics-worker-test.rs",
            "description": "This file serves as an example or test for the `libdd-telemetry` library, demonstrating how to set up a telemetry worker, register and send metrics, and add logs to a file-based telemetry endpoint.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/examples/tm-send-sketch.rs",
            "description": "This file is an example program demonstrating how to build and send telemetry data, specifically DDSketches, to the Datadog telemetry intake using the `libdd-telemetry` crate.",
            "spof": false
          },
          {
            "path": "libdd-telemetry/examples/tm-ping.rs",
            "description": "This file is an example or utility demonstrating how to send an 'AppStarted' telemetry event to a backend using the `libdd-telemetry` crate. It constructs a telemetry payload with application and host details and sends it via an HTTP POST request.",
            "spof": false
          },
          {
            "path": "libdd-telemetry/src/metrics.rs",
            "description": "This file defines structures and logic for collecting, aggregating, and managing telemetry metrics such as counts, gauges, and distributions. It handles the registration of metric contexts, recording of data points, and flushing of aggregated metrics.",
            "spof": true
          },
          {
            "path": "libdd-telemetry/src/data/metrics.rs",
            "description": "This file defines data structures for representing and serializing telemetry metrics and distributions within the `libdatadog` library. It includes structs for metric series and distributions, along with enums for metric namespaces and types.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/src/health_metrics.rs",
            "description": "This module defines the health metrics emitted by the libdatadog trace exporter, including their types, naming conventions, and conditions for emission, to provide visibility via DogStatsD.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/src/telemetry/error.rs",
            "description": "Defines the error types (`TelemetryError`) for the telemetry module, covering issues during client building and metric submission.",
            "spof": false
          },
          {
            "path": "libdd-data-pipeline/src/telemetry/metrics.rs",
            "description": "This file defines and manages telemetry metrics for a data pipeline, including API requests, errors, bytes, responses, and chunk processing, allowing them to be registered and accessed by kind.",
            "spof": true
          },
          {
            "path": "libdd-data-pipeline/src/telemetry/mod.rs",
            "description": "This module provides the `TelemetryClient` responsible for building and sending telemetry data, specifically metrics related to data pipeline operations, to a telemetry worker/agent.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/service/telemetry.rs",
            "description": "Manages and processes telemetry data for the Datadog sidecar, including metrics, dependencies, and integrations, utilizing a telemetry worker and shared memory for communication. It also handles caching for Composer package dependencies.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Jules Wiriath",
            "percent": 48
          },
          {
            "name": "Edmund Kump",
            "percent": 16
          },
          {
            "name": "Alexandre Rulleau",
            "percent": 15
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 23,
      "spofCount": 14
    },
    "busFactor": 2,
    "authorCount": 8
  },
  "Crash Reporting & Diagnostics": {
    "description": "Automatically detects application crashes, captures detailed stack traces and system state, and sends reports to help developers debug and resolve stability issues faster.",
    "functions": {
      "Crash Detection & Collection": {
        "files": [
          {
            "path": "libdd-crashtracker/CHANGELOG.md",
            "description": "This file documents the changes made in different versions of the libdd-crashtracker component. It currently shows the initial release for version 1.0.0.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/README.md",
            "description": "This README describes libdd-crashtracker, a Datadog APM library for detecting program crashes, generating detailed reports with stack traces and metadata, and asynchronously sending them to the Datadog backend using a two-process architecture.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/README.md",
            "description": "This README describes the libdatadog crash tracker module, which enables libdatadog profilers to send crash reports to the Datadog backend. It details the module's components: a CrashInfo struct, a UNIX crash-handler, and a receiver binary, along with usage instructions.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/runtime_callback.rs",
            "description": "This module provides a system for registering and invoking runtime-specific callbacks to collect stack trace information for enhanced crash tracing, particularly for integration with other language runtimes like Ruby or Python.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/lib.rs",
            "description": "This file implements a crashtracker library that catches UNIX signals (or Windows exceptions), collects crash-related information, and uploads it to a backend. It operates with a two-part architecture: an in-process signal handler and an out-of-process receiver.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/collector/atomic_set.rs",
            "description": "This module defines an `AtomicMultiset` for lock-free operations, enabling the registration and consumption of metadata by crash signal handlers for inclusion in crash reports.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/process_handle.rs",
            "description": "This file defines the `ProcessHandle` struct, which manages a handle to a process, including its Unix domain socket file descriptor and optional process ID. It provides methods to create a handle and to finish/cleanup the process, ensuring the UDS is closed and the child process is reaped.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/additional_tags.rs",
            "description": "This file manages a thread-safe, atomic multiset of additional tags, providing functions to insert, remove, clear, and emit these tags for crash tracking purposes.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/signal_handler_manager.rs",
            "description": "This file manages the registration and chaining of UNIX signal handlers, primarily for crash detection, and handles the setup of an alternate signal stack.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/counters.rs",
            "description": "This file defines atomic counters to track the active state of various operations within a library, primarily for profiling and crash-tracking purposes. It provides functions to increment, decrement, reset, and emit these counters as structured JSON.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/collector_manager.rs",
            "description": "This file manages the spawning and execution of a child process dedicated to collecting and emitting crash reports. It handles forking, setting up the child process's environment, and initiating the crash reporting mechanism.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/collector/crash_handler.rs",
            "description": "This file implements the core crash and panic handling logic for the libdatadog crashtracker, including registering signal handlers, capturing crash-related metadata, and dispatching crash reports in a signal-safe manner.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/collector/saguard.rs",
            "description": "This file defines `SaGuard`, a lexically-scoped guard that temporarily blocks and ignores a specified set of signals, preventing their emission or handling during critical operations, and restores the original signal handling state upon dropping.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/api.rs",
            "description": "This file defines the public API for the crash-tracking infrastructure, providing functions to initialize, reconfigure, and handle post-fork setup for the crash reporter, including signal handling and alternative stack configuration.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/emitters.rs",
            "description": "This file contains functions responsible for collecting and emitting various pieces of crash-related information, including configuration, process details, signal info, metadata, and stack traces, in a structured format for the Datadog Crashtracker.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/collector/spans.rs",
            "description": "Manages thread-safe collection and emission of active span and trace IDs for crash tracking. It provides functions to insert, remove, clear, and write these IDs to a stream.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/mod.rs",
            "description": "This file serves as the main module for the crash collector in `libdd-crashtracker`. It aggregates and re-exports core functionalities for managing crash handling, collecting various metadata like tags, counters, spans, and traces, and providing an API for the collector.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector_windows/mod.rs",
            "description": "This module provides the Windows-specific implementation details for the crash tracker component. It serves as the main entry point for Windows crash collection functionalities.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector_windows/api.rs",
            "description": "This file implements the Windows-specific API for the crash-tracking and reporting system. It handles initialization, registers for Windows Error Reporting (WER) events, collects crash information (like stack traces and thread data), and uploads it.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/shared/configuration.rs",
            "description": "This file defines data structures and associated logic for configuring the crashtracker, including stack trace collection options and receiver process settings.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/emit_sicodes.c",
            "description": "This C file provides a function to translate OS-specific `si_code` values, used in signal handling, into a unified `SiCodes` enum for a crash tracker. This workaround addresses the variability of `si_code` constants across different operating systems.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/sig_info.rs",
            "description": "This file defines data structures and conversion logic for handling Unix signal information (`siginfo_t`) in a human-readable format, specifically mapping raw signal numbers and codes to Rust enums for crash reporting.",
            "spof": false
          },
          {
            "path": "docs/RFCs/0004-crashtracker-prevent-hangs.md",
            "description": "This RFC proposes a new architecture for the crashtracker component to mitigate hangs and crashes by splitting its operations into watchdog, collector, and receiver processes, implementing timeouts, and a heartbeat mechanism.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker-ffi/tests/collector_windows_test.rs",
            "description": "This file contains a Windows-specific integration test for the crash reporting mechanism. It executes a separate application designed to crash, then verifies that a crash report is generated correctly and contains expected information.",
            "spof": false
          },
          {
            "path": "spawn_worker/src/crashtracking_trampoline.cpp",
            "description": "This file implements a Windows Error Reporting (WER) out-of-process crash handler that acts as a trampoline. It identifies the PHP and Datadog tracer modules in a crashed process and forwards the crash event to the tracer's own crash handling callback.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Gregory LEOCADIE",
            "percent": 68
          },
          {
            "name": "Gyuheon Oh",
            "percent": 11
          },
          {
            "name": "Julio Gonzalez",
            "percent": 8
          }
        ]
      },
      "Crash Report Processing & Upload": {
        "files": [
          {
            "path": "libdd-crashtracker/libdatadog-crashtracking-receiver.c",
            "description": "This file implements a C program that acts as a receiver for Datadog crash tracking, processing crash reports provided via standard input.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/collector/receiver_manager.rs",
            "description": "This file manages the spawning, configuration, and communication with a separate crash receiver process. It handles process creation (fork/exec), inter-process communication via Unix sockets, and configuration storage for signal handler contexts.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/receiver/benchmark.rs",
            "description": "This file provides a benchmark-specific entry point for the crash receiver, wrapping the main receiver entry point for performance testing purposes.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/receiver/mod.rs",
            "description": "This module defines the entry points and overall structure for the crash report receiver component of the `libdd-crashtracker` library. It handles receiving crash information, configuration, and signals, primarily via Unix sockets or standard input.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/receiver/entry_points.rs",
            "description": "This file defines entry points for the crash tracker receiver, allowing it to accept crash reports via standard input or Unix sockets, process them (e.g., resolve stack frames), and upload them to a configured endpoint.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/receiver/receive_report.rs",
            "description": "This file implements a state machine to receive and parse crash report data, line by line, from a crash-tracker collector, assembling it into a `CrashInfo` object.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/telemetry.rs",
            "description": "This file defines structures and logic for creating and uploading telemetry events related to crash processing. It handles sending 'crash pings' to indicate the start of crash processing and 'crash info' upon completion.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/errors_intake.rs",
            "description": "This file defines the configuration logic and data structures for sending crash and error reports to Datadog's errors intake endpoint, supporting both direct submission and agent-based reporting.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/benches/receiver_bench.rs",
            "description": "This file contains benchmarks for the `receiver_entry_point` function of the `libdd-crashtracker` library, evaluating its performance when processing simulated crash reports.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/benches/main.rs",
            "description": "This file serves as the main entry point for running benchmarks for the libdd-crashtracker library, using the Criterion framework. It conditionally includes and executes benchmark functions, primarily for receiver components on Unix systems when the 'benchmarking' feature is enabled.",
            "spof": false
          },
          {
            "path": "datadog-tracer-flare/src/error.rs",
            "description": "This file defines the `FlareError` enum, which represents various error types that can occur within the tracer flare component. It also implements standard error traits for this enum.",
            "spof": true
          },
          {
            "path": "datadog-tracer-flare/src/zip.rs",
            "description": "This file provides utilities for creating zip archives of specified files and directories, and for formatting these archives into a multipart form-data payload for transmission as a 'flare' to a Datadog agent.",
            "spof": false
          },
          {
            "path": "datadog-tracer-flare/src/lib.rs",
            "description": "This module provides the core logic for managing tracer flare functionality, including collecting diagnostic data and its transmission, with support for optional remote configuration to control these operations.",
            "spof": true
          },
          {
            "path": "datadog-tracer-flare/tests/test_tracer_flare.rs",
            "description": "Integration tests for the `datadog-tracer-flare` crate, verifying its functionality related to remote configuration, log level management, and flare data submission to a Datadog agent.",
            "spof": true
          },
          {
            "path": "datadog-sidecar/src/crashtracker.rs",
            "description": "This file defines the function responsible for generating the filesystem path for the crash tracker's Unix domain socket, adapting its location based on the operating system.",
            "spof": false
          },
          {
            "path": "datadog-sidecar/src/dump.rs",
            "description": "This file provides functionality to dump information about currently running Tokio tasks, including their traces, primarily when built for Linux with unstable Tokio features enabled. Otherwise, it returns an empty string.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Scarlett",
            "percent": 47
          },
          {
            "name": "Gyuheon Oh",
            "percent": 33
          },
          {
            "name": "Jules Wiriath",
            "percent": 11
          }
        ]
      },
      "Foreign Function Interface (FFI)": {
        "files": [
          {
            "path": "libdd-crashtracker/src/common.rs",
            "description": "This file provides common utilities for the `libdd-crashtracker` component, including functions to locate test directories and a safe wrapper for dynamically loading shared libraries and resolving symbols.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/crash_info/cxx.rs",
            "description": "This file provides CXX bindings for the `crash_info` module, enabling a safe and idiomatic C++ API to interact with Rust's crash information data structures and builder patterns. It defines FFI-compatible types and wrapper functions for type conversion between C++ and Rust.",
            "spof": true
          },
          {
            "path": "examples/ffi/crashinfo.cpp",
            "description": "This file is an FFI example demonstrating how to programmatically construct a `CrashInfo` object using `libdatadog`'s crash tracker, including building stack traces, adding frames, and thread information.",
            "spof": false
          },
          {
            "path": "examples/ffi/crashtracking.c",
            "description": "This file provides an example C program demonstrating the use of the `libdatadog` crash tracking library. It initializes the crash tracker, adds metadata, and then intentionally triggers a segmentation fault to show how crash reports are generated.",
            "spof": true
          },
          {
            "path": "examples/cxx/crashinfo.cpp",
            "description": "This file provides a C++ example demonstrating how to use the libdatadog crash tracker's C++ bindings to programmatically build a detailed crash report, including metadata, process info, OS info, and a stack trace, then serialize it to JSON.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker-ffi/README.md",
            "description": "This README describes `libdd-crashtracker-ffi`, which provides C-compatible Foreign Function Interface (FFI) bindings for the `libdd-crashtracker` library. Its purpose is to enable cross-language crash tracking in applications written in C, C++, and other languages by exposing a C API.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker-ffi/src/runtime_callback.rs",
            "description": "This module provides FFI bindings for registering runtime-specific crash callbacks, allowing dynamic languages to provide stack traces during crashes. It defines types and functions to register callbacks for collecting runtime stack frames or complete stack trace strings.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/receiver.rs",
            "description": "This file provides FFI entry points for receiving crash data from a crash collector via stdin or a Unix socket. It formats this data into JSON and emits it to a configured destination, acting as a sidecar to safely handle crash reporting.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/lib.rs",
            "description": "This file serves as the main library entry point for the `libdd-crashtracker-ffi` crate, organizing and exposing platform-specific modules and functionalities for crash collection, reception, and information processing.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/collector/additional_tags.rs",
            "description": "This file provides C FFI functions for managing additional tags within the Datadog crash tracker, allowing tags to be added, removed, and cleared to provide context during crash analysis.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/collector/spans.rs",
            "description": "This file provides FFI (Foreign Function Interface) functions for managing active trace and span IDs within a crash tracker. It allows for clearing, inserting, and removing these 128-bit IDs, primarily used to record ongoing operations at the time of a crash, especially in `fork` scenarios.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/collector/counters.rs",
            "description": "This file provides FFI (Foreign Function Interface) for managing atomic counters related to crash tracking operations, allowing external C-compatible code to reset, increment, and decrement operation counts.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/collector/mod.rs",
            "description": "This file provides the Foreign Function Interface (FFI) for the Datadog crash tracker collector, exposing C-compatible functions to initialize, enable, disable, reconfigure, and manage the crash-tracking infrastructure.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/collector/datatypes.rs",
            "description": "This file defines C-compatible data structures and conversion logic for configuring and interacting with the `libdd_crashtracker` library via a Foreign Function Interface (FFI). It provides the external API types for the crashtracker's configuration and operation results.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/demangler/mod.rs",
            "description": "This file provides a Foreign Function Interface (FFI) for demangling C++ symbols, converting mangled names into human-readable forms for crash tracking purposes. It uses the `symbolic-demangle` library to perform the actual demangling.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/sig_info.rs",
            "description": "Defines the FFI-compatible SigInfo struct and provides conversion logic from it to the internal libdd_crashtracker::SigInfo type, facilitating signal information exchange.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/stacktrace.rs",
            "description": "This file provides the C Foreign Function Interface (FFI) for managing `StackTrace` objects within the `libdd-crashtracker` library. It exposes functions to create, modify, and manage the lifecycle of stack trace information across language boundaries.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/thread_data.rs",
            "description": "This file defines the `ThreadData` struct for FFI (Foreign Function Interface) and handles the conversion of thread-specific crash information from the FFI representation to the internal `libdd_crashtracker` data structure.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/metadata.rs",
            "description": "This file defines the FFI-compatible `Metadata` struct used for crash tracking, including library name, version, family, and tags. It also provides a conversion mechanism from this FFI-compatible struct to the internal `libdd_crashtracker::Metadata` type.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/os_info.rs",
            "description": "This file defines a C-compatible structure for operating system information and provides a conversion implementation to transform FFI `CharSlice` types into native Rust strings for the `libdd_crashtracker` library.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/proc_info.rs",
            "description": "This file defines the C-compatible `ProcInfo` structure for representing process and thread IDs in the crash tracker FFI, and provides conversion logic to an internal Rust `libdd_crashtracker::ProcInfo` type.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/api.rs",
            "description": "This file provides the C-compatible Foreign Function Interface (FFI) for the `CrashInfo` object from the `libdd_crashtracker` crate. It exposes functions for manipulating, enriching, and uploading crash information across the FFI boundary.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/span.rs",
            "description": "This file defines the FFI-compatible `Span` struct and implements conversion logic from this FFI struct to the internal `libdd_crashtracker::Span` type, primarily for marshalling span-related data like ID and thread name across the FFI boundary.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/stackframe.rs",
            "description": "This file provides the C-compatible Foreign Function Interface (FFI) for creating, dropping, and populating `StackFrame` objects used in crash tracking. It exposes functions to set various properties of a stack frame such as instruction pointer, module base address, build ID, file type, path, and source code location.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/collector_windows/mod.rs",
            "description": "This file is the main module for the Windows-specific crash tracker collector, likely defining its public API.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/collector_windows/api.rs",
            "description": "This file provides the C FFI (Foreign Function Interface) for the Datadog crash tracker on Windows, including initialization and callbacks for Windows Error Reporting (WER) to handle out-of-process exceptions.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/tests/test_app/src/main.rs",
            "description": "This is a Windows-specific test application that initializes a crash tracker using `libdd_crashtracker_ffi` and then intentionally triggers a segfault to verify the crash reporting mechanism.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Daniel Schwartz-Narbonne",
            "percent": 71
          },
          {
            "name": "Julio Gonzalez",
            "percent": 12
          },
          {
            "name": "Gregory LEOCADIE",
            "percent": 8
          }
        ]
      },
      "Crash Information & Symbolication Model": {
        "files": [
          {
            "path": "libdd-crashtracker/src/shared/mod.rs",
            "description": "This module holds constants and structures that are shared between the collector and receiver components of the libdd-crashtracker.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/shared/constants.rs",
            "description": "Defines shared string constants and a default timeout for the Datadog crash tracker, used as markers for different sections of crash data.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/metadata.rs",
            "description": "Defines the `Metadata` struct used to store information about the crash tracker's library, version, family, and associated tags for serialization and deserialization purposes.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/unknown_value.rs",
            "description": "This file defines the `UnknownValue` trait, which provides a contract for types that can represent an unknown or default value, likely within the context of crash information handling.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/experimental.rs",
            "description": "Defines the `Experimental` struct, which encapsulates optional, experimental, or supplemental crash-related information such as additional tags, ucontext, and runtime stack details for the libdatadog crash tracker.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/proc_info.rs",
            "description": "This file defines the `ProcInfo` struct, which stores a process ID and an optional thread ID. It is used within the libdatadog crash tracker to represent process-related information.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/crash_info/stacktrace.rs",
            "description": "This file defines data structures for representing stack traces and individual stack frames. It includes logic for creating, manipulating, and populating stack traces with information like function names, file paths, line numbers, and module details, including demangling and symbol resolution.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/crash_info/spans.rs",
            "description": "This file defines the `Span` struct, which represents a unit of execution or context, likely used within crash information, including an ID and an optional thread name. It supports JSON serialization and deserialization.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/test_utils.rs",
            "description": "This file provides a `TestInstance` trait for generating test data or instances, exclusively used within the testing environment.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/os_info.rs",
            "description": "Defines the `OsInfo` struct to store and serialize operating system details such as architecture, bitness, type, and version, including conversion from the `os_info` crate's `Info` type.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/src/crash_info/error_data.rs",
            "description": "This file defines data structures for representing crash and error information, including stack traces and thread data. It also provides functionality, primarily for Unix, to process these stack traces by normalizing instruction pointers, resolving symbols, and demangling names.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/src/crash_info/mod.rs",
            "description": "This module defines the `CrashInfo` struct, which encapsulates all relevant data about a crash, and provides methods for its construction, enrichment, serialization to file, and uploading to configured endpoints.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker/tests/libtest_cpp.cpp",
            "description": "This file contains C++ functions, classes, and namespaces designed to provide various symbol examples for normalization and symbolization tests, likely for a crash tracker or similar debugging tool.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker/tests/libtest.c",
            "description": "This C file is a test utility designed to generate a program with large and potentially compressed debug sections, used to test the robustness of a symbolization tool like blazesym in handling address normalization and symbolization failures.",
            "spof": false
          },
          {
            "path": "docs/RFCs/0006-crashtraker-incomplete-stacktraces.md",
            "description": "This RFC describes version 1.1 of the `libdatadog` crashtracker structured log format. It primarily introduces an 'incomplete' flag for stack traces to indicate missing frames.",
            "spof": true
          },
          {
            "path": "docs/RFCs/0007-crashtracker-experimental-features.md",
            "description": "This RFC defines version 1.2 of the libdatadog crashtracker structured log format, introducing an 'experimental' field for flexible data collection.",
            "spof": true
          },
          {
            "path": "docs/RFCs/0003-crashtracker-design.md",
            "description": "This RFC details the design, priorities, and architecture of the crashtracker, aiming to balance reliable crash data collection with minimal impact on the system. It outlines the collector and receiver components, discussing risks and mitigations for both normal operation and crash scenarios.",
            "spof": false
          },
          {
            "path": "docs/RFCs/0005-crashtracker-structured-log-format.md",
            "description": "This document describes RFC 0005, which specifies version 1.0 of the Datadog Crashtracker Structured Log Format, outlining its motivation, proposed structure, and fields for reporting crash information.",
            "spof": true
          },
          {
            "path": "docs/RFCs/0012-crashtracker-runtime-stack-callback-registration.md",
            "description": "This RFC describes how the crashtracker can emit runtime (language-level) stack information in addition to native backtraces, detailing the registration API for runtimes and the data streaming format. It aims to provide a stable contract for language runtimes to supply stack details for crash reports.",
            "spof": true
          },
          {
            "path": "docs/RFCs/0009-crashtracker-stackframe-mangled-name.md",
            "description": "This document is an RFC (Request for Comments) proposing an update (version 1.4) to the crashtracker structured log format. It specifically adds an optional `mangled_name` field to stack frame entries to preserve original symbol names after demangling.",
            "spof": true
          },
          {
            "path": "docs/RFCs/0008-crashtracker-stackframe-comments.md",
            "description": "This document describes RFC 0008, detailing version 1.3 of the crashtracker structured log format, which adds an optional `comments` field to stackframes for richer debugging information.",
            "spof": true
          },
          {
            "path": "docs/RFCs/0013-crashtracker-errors-intake-payload.md",
            "description": "This RFC specifies the payload schema for crashtracker errors ingested by Datadog, outlining the structure, required fields, and the mapping of crash metadata to ddtags.",
            "spof": true
          },
          {
            "path": "docs/RFCs/0011-crashtracker-structured-log-format-V1_X.md",
            "description": "This document defines the structured log format (versions 1.0-1.4) for crash information collected by the `libdatadog` crashtracker, serving as the authoritative specification for crash reports.",
            "spof": true
          },
          {
            "path": "libdd-crashtracker-ffi/src/demangler/datatypes.rs",
            "description": "This file defines the `DemangleOptions` enum, which specifies different strategies for demangling symbols (e.g., complete demangling or name-only demangling) within the libdd-crashtracker-ffi component.",
            "spof": false
          },
          {
            "path": "libdd-crashtracker-ffi/src/crash_info/mod.rs",
            "description": "This file acts as the main module for the `crash_info` directory, defining and re-exporting various sub-modules that together constitute the crash information structure and associated utilities.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Gyuheon Oh",
            "percent": 74
          },
          {
            "name": "Daniel Schwartz-Narbonne",
            "percent": 23
          },
          {
            "name": "Igor Unanua",
            "percent": 2
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 93,
      "spofCount": 33
    },
    "busFactor": 2,
    "authorCount": 9
  },
  "Feature Flag Management": {
    "description": "Provides a robust system for developers to remotely enable or disable application features, supporting controlled rollouts, A/B testing, and dynamic user segmentation.",
    "functions": {
      "Rules-Based Flag Evaluation": {
        "files": [
          {
            "path": "datadog-ffe/README.md",
            "description": "This README describes 'datadog-ffe', an internal DataDog library for Feature Flag evaluation, intended for use in tracers and DataDog services. It notes that the library is subject to frequent breaking changes before stabilization.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/lib.rs",
            "description": "This file serves as the main library entry point for the `datadog-ffe` crate. It defines and exposes core components related to feature flag types and provides a module for rules-based feature flag evaluation.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/error.rs",
            "description": "This file defines the `EvaluationError` enum, which enumerates all possible reasons for errors or non-error outcomes (like a disabled flag or default assignment) during the evaluation of feature flags within the `rules_based` system.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/mod.rs",
            "description": "This module serves as the main entry point for the rules-based feature flag evaluation system. It re-exports core components like configuration, evaluation logic, and data structures for universal flag management.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/sharder.rs",
            "description": "This file implements a sharding mechanism using MD5 hashing, specifically a `PreSaltedSharder` that distributes inputs across a fixed number of shards, with an option to pre-salt the hash context.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/ufc/assignment.rs",
            "description": "This file defines the data structures for representing the result of a feature flag assignment, including the assigned value, the reason for the assignment, and methods for type conversion and extraction.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/eval/eval_rules.rs",
            "description": "This file defines the evaluation logic for rules and their conditions, implementing how various comparison, regex, membership, and null checks are performed against attributes in an evaluation context.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/eval/mod.rs",
            "description": "This file serves as the module entry point for the rules-based evaluation logic, aggregating and re-exporting components related to assignment, rule processing, and evaluation context for feature flags or experimentation.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/eval/evaluation_context.rs",
            "description": "Defines the `EvaluationContext` struct used for storing and retrieving attributes during feature flag evaluation, including a special handling for a 'targeting key' attribute. It also includes Python interoperability for creating context from Python objects.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/eval/eval_assignment.rs",
            "description": "This file implements the core logic for evaluating feature flags in a rules-based system, determining the appropriate assignment (variation) for a given subject based on configuration, rules, allocations, splits, and sharding.",
            "spof": true
          },
          {
            "path": "datadog-ffe/benches/eval.rs",
            "description": "This file contains benchmarks for the feature flag evaluation logic (get_assignment) of the datadog-ffe crate, measuring performance using both SDK test data and a single flag evaluation.",
            "spof": true
          },
          {
            "path": "datadog-ffe/tests/data/tests",
            "description": "This directory is intended to store test data or fixtures for the `datadog-ffe` component within the `libdatadog` project. It likely provides specific input or expected output for feature flag evaluation test cases.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Oleksii Shmalko",
            "percent": 96
          },
          {
            "name": "Bjrn Antonsson",
            "percent": 3
          },
          {
            "name": "Thomas Kowalski",
            "percent": 1
          }
        ]
      },
      "Core Data Types & Utilities": {
        "files": [
          {
            "path": "datadog-ffe/CHANGELOG.md",
            "description": "This file is a changelog documenting the version history and updates for the datadog-ffe component within the libdatadog library.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/flag_type.rs",
            "description": "Defines `FlagType` and `ExpectedFlagType` enums for representing different data types of feature flags, including their serialization, deserialization, and compatibility checks. These enums are likely used in a feature flag evaluation or configuration system.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/timestamp.rs",
            "description": "This file provides a simple wrapper around the `chrono` crate to define a `Timestamp` type as `DateTime<Utc>` and a utility function `now()` for getting the current UTC timestamp, abstracting away direct dependency on `chrono`.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/str.rs",
            "description": "This module defines a custom `Str` type, an optimized string representation built on `FastStr` for cheap cloning and flexible internal representation. It provides various conversions and trait implementations for serialization, display, and Python interoperability.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/attributes.rs",
            "description": "Defines a flexible `Attribute` enum that can hold numbers, strings, booleans, or null values, providing methods for type coercion and integration with Python data types for evaluation contexts.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Oleksii Shmalko",
            "percent": 92
          },
          {
            "name": "Thomas Kowalski",
            "percent": 8
          }
        ]
      },
      "Universal Flag Configuration Management": {
        "files": [
          {
            "path": "datadog-ffe/src/rules_based/configuration.rs",
            "description": "This file defines the `Configuration` struct, which represents the remote configuration for a feature flagging client. It encapsulates the fetched flags and provides methods for accessing and managing this configuration.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/ufc/models.rs",
            "description": "This file defines the data models (structs and enums) for Universal Flag Configuration (UFC), including flags, variations, allocations, and rules-based conditions used in feature flag evaluation. It also includes a `TryParse` utility for resilient deserialization.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/ufc/mod.rs",
            "description": "This file defines and exposes the Universal Flag Configuration (UFC) module, consolidating and re-exporting its sub-components like assignment logic, compiled configurations, and data models.",
            "spof": true
          },
          {
            "path": "datadog-ffe/src/rules_based/ufc/compiled_flag_config.rs",
            "description": "This file defines the data structures for a compiled Universal Flag Configuration (UFC) and provides the logic to convert a raw configuration from its 'wire' format into this optimized, internal representation for feature flag evaluation.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Oleksii Shmalko",
            "percent": 100
          }
        ]
      },
      "FFI Abstraction Layer": {
        "files": [
          {
            "path": "examples/ffi/ffe.c",
            "description": "This file is a C example demonstrating the usage of Datadog's Feature Flag Evaluation (FFE) Foreign Function Interface (FFI). It shows how to load flag configurations, create an evaluation context, and evaluate feature flags with various types and handle results.",
            "spof": true
          },
          {
            "path": "datadog-ffe-ffi/src/handle.rs",
            "description": "This file defines a generic, opaque `Handle` struct that manages ownership of a heap-allocated resource `T` for safe FFI (Foreign Function Interface) usage, providing explicit memory deallocation.",
            "spof": true
          },
          {
            "path": "datadog-ffe-ffi/src/configuration.rs",
            "description": "This file provides Foreign Function Interface (FFI) bindings for creating and managing feature flag `Configuration` objects from JSON bytes. It exposes C-compatible functions to instantiate a configuration from server responses and to free its resources.",
            "spof": true
          },
          {
            "path": "datadog-ffe-ffi/src/evaluation_context.rs",
            "description": "This file provides the FFI (Foreign Function Interface) for creating and managing an `EvaluationContext` used in feature flagging or rules-based evaluation within the Datadog Feature Flag Evaluation (FFE) library.",
            "spof": true
          },
          {
            "path": "datadog-ffe-ffi/src/assignment.rs",
            "description": "This file provides the Foreign Function Interface (FFI) bindings for evaluating Datadog feature flags, defining data structures and functions to expose assignment results and their details to C callers.",
            "spof": true
          },
          {
            "path": "datadog-ffe-ffi/src/lib.rs",
            "description": "This file is the main library entry point (crate root) for the `datadog-ffe-ffi` Rust crate. It defines and re-exports modules related to Foreign Function Interface (FFI) bindings for Datadog's Feature Flag Evaluation, including assignment, configuration, evaluation context, and handles.",
            "spof": true
          },
          {
            "path": "datadog-ffe-ffi/CHANGELOG.md",
            "description": "This file is a changelog for the `datadog-ffe-ffi` component, documenting its version history. It details bug fixes, feature updates, and release notes across different versions.",
            "spof": true
          }
        ],
        "contributors": [
          {
            "name": "Sameeran Kunche",
            "percent": 65
          },
          {
            "name": "Oleksii Shmalko",
            "percent": 35
          }
        ]
      }
    },
    "stats": {
      "totalFiles": 28,
      "spofCount": 27
    },
    "busFactor": 1,
    "authorCount": 2
  },
  "Data Security & Obfuscation": {
    "description": "Automatically identifies and redacts sensitive information such as PII, credit card numbers, and credentials from traces and logs to ensure data privacy and help meet compliance requirements.",
    "functions": {
      "Obfuscation Orchestration & Rule Engine": {
        "files": [
          {
            "path": "libdd-trace-obfuscation/CHANGELOG.md",
            "description": "This file is the changelog for the `libdd-trace-obfuscation` component, documenting its version history and changes.",
            "spof": true
          },
          {
            "path": "libdd-trace-obfuscation/src/replacer.rs",
            "description": "This file defines structures and functions for applying regular expression-based replacement rules to obfuscate or sanitize data within Datadog trace spans. It provides mechanisms to parse rules, compile regexes, and apply these rules to specific span tags or resource names.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/src/obfuscation_config.rs",
            "description": "This file defines the `ObfuscationConfig` struct and handles loading various data obfuscation settings from environment variables for APM traces.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Julio Gonzalez",
            "percent": 100
          }
        ]
      },
      "Sensitive Data Redactors": {
        "files": [
          {
            "path": "libdd-trace-obfuscation/README.md",
            "description": "This README provides an overview of the `libdd-trace-obfuscation` library, detailing its purpose as a Datadog trace obfuscation library that handles SQL, Redis, Memcached, HTTP URLs, credit card numbers, and stack traces.",
            "spof": true
          },
          {
            "path": "libdd-trace-obfuscation/src/lib.rs",
            "description": "This file serves as the main library entry point for data obfuscation utilities within the `libdd-trace-obfuscation` crate. It exposes modules for obfuscating sensitive information across various data types and protocols like HTTP, SQL, Redis, and credit card numbers.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/src/http.rs",
            "description": "This file provides a utility function for obfuscating URLs by removing sensitive information like usernames, passwords, query strings, and digits within path segments.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/src/redis_tokenizer.rs",
            "description": "This file implements a tokenizer for Redis commands, splitting a Redis query string into individual commands and their arguments. It handles various formatting, including whitespace, newlines, and quoted arguments.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/src/credit_cards.rs",
            "description": "This file contains utility functions for identifying potential credit card numbers within strings, using issuer identification number (IIN) prefix validation and the Luhn algorithm.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/src/ip_address.rs",
            "description": "This file provides functions to quantize and obfuscate IP addresses found in peer tags for trace metrics, replacing non-allowed IP addresses with a generic 'blocked-ip-address' string while preserving whitelisted IPs.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/src/obfuscate.rs",
            "description": "This file defines the core `obfuscate_span` function, which modifies a tracing span's metadata to redact or anonymize sensitive information based on its type (e.g., HTTP, Memcached, Redis) and configurable rules. It ensures privacy and reduces data exposure in distributed traces.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/src/redis.rs",
            "description": "This file provides functions to obfuscate sensitive data within Redis command strings by replacing specific arguments with placeholders. It implements various obfuscation strategies tailored to different Redis command types.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/src/sql.rs",
            "description": "This file provides functionality to obfuscate SQL strings by replacing literals (like numbers, strings, and hex values) with '?' characters. It implements a non-rigorous parsing algorithm to identify and mask these sensitive values for privacy or security purposes.",
            "spof": false
          }
        ],
        "contributors": [
          {
            "name": "Igor Unanua",
            "percent": 100
          }
        ]
      },
      "Obfuscation Performance Benchmarking": {
        "files": [
          {
            "path": "libdd-trace-obfuscation/benches/trace_obfuscation.rs",
            "description": "This file serves as the main entry point for running Criterion benchmarks related to various trace obfuscation functionalities, including credit card, Redis, SQL, and IP address obfuscation.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/benches/benchmarks/ip_address_bench.rs",
            "description": "This file contains benchmarks for the `ip_address` module, specifically testing the performance of the `quantize_peer_ip_addresses` function with various input strings.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/benches/benchmarks/credit_cards_bench.rs",
            "description": "This file contains benchmarks for the `is_card_number` function, evaluating its performance with and without Luhn algorithm validation for various credit card number inputs.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/benches/benchmarks/replace_trace_tags_bench.rs",
            "description": "This file contains benchmarks for the `replace_trace_tags` function, which obfuscates or modifies tags within Datadog trace spans based on a set of defined replacement rules.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/benches/benchmarks/mod.rs",
            "description": "This file serves as a module organizing various benchmarks for different obfuscation functionalities, such as credit cards, IP addresses, Redis, and SQL, within the libdatadog trace obfuscation library.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/benches/benchmarks/redis_obfuscation_bench.rs",
            "description": "This file contains benchmarks for the Redis command obfuscation functionality within the `libdd-trace-obfuscation` library. It measures the performance of obfuscating a variety of Redis command strings.",
            "spof": false
          },
          {
            "path": "libdd-trace-obfuscation/benches/benchmarks/sql_obfuscation_bench.rs",
            "description": "This file contains benchmarks for the SQL obfuscation functionality within the `libdd-trace-obfuscation` library, using various SQL queries as test cases to measure performance.",
            "spof": false
          }
        ],
        "contributors": []
      }
    },
    "stats": {
      "totalFiles": 19,
      "spofCount": 2
    },
    "busFactor": 2,
    "authorCount": 2
  }
}